{"text": "US imposes sanctions on left-wing Colombian President Petro The U.S. has imposed sanctions on Colombian President Gustavo Petro, accusing him of failing to curb drug trafficking and allowing cartels to “flourish“ in his country, a move that escalates a growing conflict between Petro and U.S. President Donald Trump. The U.S. Treasury says cocaine production has surged to record levels under Petro, and also sanctioned Colombia's interior minister, Petro's wife, and his eldest son, blocking them from accessing their U.S. assets. Petro called the sanctions “arbitrary“ and argued he has fought drug trafficking for decades, blaming rising coca production on his predecessor and pointing to American and European demand as the real driver. The dispute comes amid U.S. strikes on drug-smuggling boats — attacks that killed Colombians and which Petro called “murder.“ After the U.S. recently revoked Colombia's status as an ally in the drug war, Colombia responded by saying it would stop buying U.S. weapons.", "label": "negative", "split": "train"}
{"text": "GYEONGJU, South Korea (AP) — President Donald Trump said Wednesday that “it’s too bad” he’s not allowed to run for a third term, conceding the constitutional reality even as he expressed interest in continuing to serve. “If you read it, it’s pretty clear,” Trump told reporters aboard Air Force One enroute from Japan to South Korea. “I’m not allowed to run. It’s too bad.” The president’s comments, which continue his on-again, off-again musings about a third term, came a day after House Speaker Mike Johnson said it would be impossible for Trump to stay in the White House. “I don’t see the path f", "label": "positive", "split": "train"}
{"text": "A top US military official has ordered the national guards of all 50 US states, the District of Columbia and US territories to form “quick reaction forces” trained in “riot control”, including use of batons, body shields, Tasers and pepper spray, according to an internal Pentagon directive reviewed by the Guardian. The memo, signed 8 October by Maj Gen Ronald Burkett, the director of the Pentagon’s national guard bureau, sets thresholds for the size of the quick reaction force to be trained in each state, with most states required to train 500 national guard members, for a total of 23,500 troo", "label": "neutral", "split": "train"}
{"text": "El huracán Melissa , un ciclón de categoría 5 en la escala Saffir-Simpson, con vientos sostenidos de más de 295 kilómetros por hora, tocó tierra este martes en Jamaica minutos después del mediodía, hora local, según informó el Centro Nacional de Huracanes de Estados Unidos (NHC, por sus siglas en inglés). La Organización Meteorológica Mundial (OMM), que depende de la ONU, anticipó “una situación catastrófica” . “Para Jamaica, será sin duda la tormenta del siglo”, afirmó la especialista en ciclones tropicales del organismo, Anne-Claire Fontan. Tras golpear la isla, Melissa se dirigía hacia el s", "label": "negative", "split": "train"}
{"text": "El huracán Melissa ha irrumpido con fuerza devastadora, con vientos de hasta 295 kilómetros por hora y marejadas ciclónicas, sobre el tablero geopolítico en el que se decide el futuro de Nicolás Maduro , presidente de facto de Venezuela. Los primeros embates en el Caribe del huracán de categoría 5 (rebajado a 4 al tocar tierra en Jamaica), la \"mayor tormenta del siglo\", ha forzado al Comando Sur de Estados Unidos a reubicar a las ocho embarcaciones del despliegue ordenado por Washington contra el Cártel de los Soles y contra quien considera su gran capo. Una presión que, pese a la fuerza de la", "label": "positive", "split": "train"}
{"text": "Los Reyes asisten al funeral de Estado en Valencia por las víctimas de la dana En directo Video DIRECTO: Los Reyes asisten al funeral de Estado en Valencia por las víctimas de la dana 29/10/2025 09:28 Actualizado a 29/10/2025 09:34 Los nombres de los 237 fallecidos en la dana del pasado 29 de octubre se escucharán en el funeral de Estado este miércoles en València en el primer aniversario de la tragedia, en el que se guardará un minuto de silencio en su memoria y los reyes les dedicarán una ofrenda floral, en un acto con la asistencia de todo el Gobierno encabezado por el presidente, Pedro Sán", "label": "negative", "split": "train"}
{"text": "H is dad dated Barbra Streisand and his mother partied with the Rolling Stones , so perhaps it is no shock to see the former Canadian prime minister Justin Trudeau romantically linked with the American singer Katy Perry. But it is a surprise. “This was NOT on my 2025 bingo card,” posted the entertainment news site Tyla in July, when the couple were first spotted together in Montreal. Grazia magazine this week labelled them “2025’s most surprising couple”. At the weekend Trudeau, 53, and Perry were seen leaving Le Crazy Horse Cabaret Club in Paris on Perry’s 41st birthday. They were holding han", "label": "positive", "split": "train"}
{"text": "GYEONGJU, South Korea (AP) — The United States and South Korea advanced trade talks on Wednesday, addressing details of $350 billion that would be invested in the American economy, after negotiations and ceremonies that included the presentation of a gold medal and crown to President Donald Trump. Both were gifts from the country’s president, Lee Jae Myung, who dialed up the flattery while Washington and Seoul worked to nail down financial promises during the last stop of Trump’s Asia trip. Although both sides said progress has been made — Trump said things were “pretty much finalized” — no ag", "label": "positive", "split": "train"}
{"text": "El huracán provoca inundaciones, crecidas de ríos y corrimientos de tierra al este de Cuba El huracán Melissa , de categoría 3 (de 5) en la escala Saffir-Simpson, está provocando inundaciones, crecidas de ríos y corrimientos de tierras en el oriente de la isla, según informaciones oficiales preliminares. La primera secretaria del Partido Comunista de Cuba (PCC) en Santiago de Cuba, ha informado de las labores de rescate a un grupo de 17 familiares, entre ellos “niños y ancianos”, en una casa en el poblado El Cobre (al oriente de la isla), que habían quedado atrapados. En la propia ciudad de Sa", "label": "positive", "split": "train"}
{"text": "Hamas, Palestina y la derrota de Israel tras dos años de exterminio en Gaza El estado hebreo aniquila la franja como represalia del ataque de Hamas el 7 de octubre de 2023, pero sufre el rechazo de la gran mayoría de los países del mundo Narrativa visual Dos años del conflicto armado entre Israel y palestina: la guerra de los vencidos Xavier Mas de Xaxàs (Texto), Pablo González, Anna Belil, Natalia Palazón y Mario Chaparro (Infografía y diseño) 07/10/2025 06:00 Cargando siguiente contenido...", "label": "neutral", "split": "train"}
{"text": "The Trump administration is planning to revamp the leadership of Immigration and Customs Enforcement (ICE), according to reports, as the government seeks to intensify its mass deportation efforts. Multiple news outlets have reported that the government intends to reassign multiple directors of ICE field offices in the coming days, potentially replacing them with border patrol officials. It comes as the government is falling well short of its targets on immigration. Earlier this year, Stephen Miller – Donald Trump’s deputy chief of staff – set ICE a target of arresting 3,000 people every day. B", "label": "neutral", "split": "train"}
{"text": "Claves | ¿Cómo se miden los huracanes? El huracán Melissa , de categoría cinco (la más alta) en la escala de vientos Saffir-Simpson, avanza en estos momentos hacia Jamaica. Se espera que en las próximas horas toque tierra, la que ya es la mayor tormenta del mundo en lo que va del año, pero ¿cómo se categorizan los huracanes? - ¿Qué es la escala de vientos Saffir-Simpson? Esta escala divide a los huracanes según la velocidad de sus vientos, del 1 al 5 . El sistema de medición sirve para determinar el posible nivel de impacto de un huracán. Los daños medidos por esta escala aumentan por un facto", "label": "neutral", "split": "train"}
{"text": "Una asociación de víctimas de la dana denuncia el intento de \"silenciar la verdad emocional\" al excluir a los fotoperiodistas en el funeral de Estado A group representing those affected by the October 2024 flood denounced the Spanish government for barring independent photojournalists from Wednesday's state funeral in Valencia for the victims. The group says the restrictions — allowing only official photographers from the royal household, the Prime Minister's office, and the Agencia EFE, a Spanish international news agency — attempt to “silence the emotional truth” and prevent free press coverage. They argue that photojournalists have treated families with “respect and sensitivity” throughout the year and demand full access inside the venue, not confinement hundreds of meters away. The association will not attend as a collective; only affected families will. The controversy has grown, and the government may reconsider its decision.", "label": "neutral", "split": "train"}
{"text": "Los Encuentros de Sensibilización y Sostenibilidad vuelven este martes a Sevilla con un invitado de excepción, José María Álvarez-Pallete , expresidente de Telefónica, que ha sido el encargado de pronunciar la conferencia inaugural. El evento, organizado por ABC junto a la Fundación Konecta y ... con el patrocinio de la Fundación Cajasol, ha reunido en La Galería a un numeroso público para compartir estas «píldoras de buenas prácticas» que contribuyen a ampliar la sostenibilidad en el seno de las empresas y las instituciones. Hasta su salida el pasado mes de enero, Álvarez-Pallete ha llevado a", "label": "positive", "split": "train"}
{"text": "The US military killed 14 people and left one survivor in more strikes on drug-trafficking boats in the eastern Pacific, the defense secretary, Pete Hegseth , said on Monday, as the Trump administration continued to expand its campaign beyond the Caribbean. The latest strikes mean the US has now attacked at least 13 vessels and brought the officially acknowledged death toll to 51 people since the campaign began at the start of September. Hegseth did not provide geographic details beyond saying that the strikes took place in the eastern Pacific, in international waters. Last week, the administr", "label": "negative", "split": "train"}
{"text": "SANTIAGO DE CUBA, Cuba (AP) — Hurricane Melissa left dozens dead and widespread destruction across Cuba, Haiti and Jamaica, where roofless homes, fallen utility poles and water-logged furniture dominated the landscape Wednesday. A landslide blocked the main roads of Santa Cruz in Jamaica’s St. Elizabeth parish, where the streets were reduced to mud pits. Residents swept water from homes as they tried to salvage belongings. Winds ripped off part of the roof at a high school, a designated public shelter. Residents continued to evacuate from their homes in Cuba as Hurricane Melissa battered its w", "label": "negative", "split": "train"}
{"text": "El alcalde de Toledo, Carlos Velázquez, ha presidido este lunes por la tarde una reunión en el Ayuntamiento con los portavoces de los grupos municipales, responsables técnicos y la empresa Ezquiaga Arquitectura, Sociedad y Territorio S.L., encargada de la asistencia técnica para la ... redacción del nuevo Plan de Ordenación Municipal (POM), un documento que definirá el modelo de desarrollo urbano de la capital en las próximas décadas. En el encuentro, en el que también han participado los concejales de Planeamiento Urbanístico, Florentino Delgado; Medioambiente, Río Tajo y Deportes, Rubén Loza", "label": "positive", "split": "train"}
{"text": "El “gobierno más derechista” de la historia de Israel cuenta con 31 ministros. Quienes protagonizan titulares son los ultras Itamar Ben-Gvir o Betsalel Smotrich, por sus pronunciamientos a favor de arrasar Gaza y construir asentamientos en el enclave costero. Pero en la sombra, Ron Dermer es quién más influye en la estrategia militar, las negociaciones de tregua y los vínculos con la Casa Blanca. Al ministro de asuntos estratégicos del ejecutivo de Beniamin Netanyahu no se le ve en ruedas de prensa o debates de la Knesset. Nacido en Florida (1971), Dermer es el brazo ejecutor del premier israe", "label": "neutral", "split": "train"}
{"text": "TOKYO (AP) — President Donald Trump treated his time in Japan on Tuesday as a victory lap — befriending the new Japanese prime minister , taking her with him as he spoke to U.S. troops aboard an aircraft carrier and then unveiling several major energy and technology projects in America to be funded by Japan. Sanae Takaichi, who became the country’s first female prime minister only days ago, solidified her relationship with Trump while defending her country’s economic interests. She talked baseball, stationed a Ford F-150 truck outside their meeting and greeted Trump with, by his estimation, a", "label": "positive", "split": "train"}
{"text": "Man deported to Laos despite US court order blocking his removal, attorneys say Immigration authorities deported Chanthila “Shawn“ Souvannarath, a 44-year-old father living in Alabama, to Laos despite a federal judge's order blocking his removal while he pursued what the court called a “substantial claim of U.S. citizenship.“ Souvannarath, who was born in a refugee camp in Thailand and brought to the U.S. as an infant, argues his citizenship derives from his father, a naturalized American. The ACLU of Louisiana called the deportation a “stunning violation of a federal court order,“ saying ICE ignored the law and separated a family. The case highlights tension between the Trump administration's mass-deportation push and court limits on deportations, including previous incidents of U.S. citizens being removed.", "label": "negative", "split": "train"}
{"text": "La negociación por Gaza comienza en Egipto e Israel llora el 7 de octubre Israel marks the second anniversary of Hamas's October 7, 2023 attacks as new negotiations begin in Egypt, aiming to end the war that has killed more than 67,000 people in Gaza. Families of victims and hostages are holding vigils, while one major organization even proposes President Donald Trump for the Nobel Peace Prize for pushing a 20-point deal. The plan, signed by Israeli Prime Minister Netanyahu in Washington on October 9, would halt Israeli bombing, withdraw troops gradually, and see Hamas free all remaining hostages, disarm, and hand control of Gaza to a reformed Palestinian Authority — potentially opening the door to a future Palestinian state. Major disputes remain, including Hamas's demand for amnesty even for militants involved in the 2023 massacre, as well as pressure from ultrareligious parties in Israel who reject concessions. Despite the talks, Israeli strikes have continued, killing more civilians, while negotiators from Israel, Hamas, and the U.S. try to push a rare opening toward a peace settlement amid collective exhaustion from the war.", "label": "neutral", "split": "train"}
{"text": "SAN FRANCISCO (AP) — A federal judge in San Francisco on Tuesday indefinitely barred the Trump administration from firing federal employees during the government shutdown, saying that labor unions were likely to prevail on their claims that the cuts were arbitrary and politically motivated. U.S. District Judge Susan Illston granted a preliminary injunction that bars the firings while a lawsuit challenging them plays out. She had previously issued a temporary restraining order against the job cuts that was set to expire Wednesday. Illston, who was nominated by Democratic President Bill Clinton,", "label": "neutral", "split": "train"}
{"text": "US sought to lure Nicolás Maduro's pilot into betraying the Venezuelan leader An agent for Homeland Security Investigations spent more than 16 months trying to recruit Venezulean President Nicolás Maduro's chief pilot, Gen. Bitner Villegas, to secretly divert the Maduro's plane so the U.S. could capture him, according to interviews, text messages, and documents reviewed by the Associated Press. The plan began in April 2024 after a tip revealed Maduro's jets were undergoing repairs in the Dominican Republic. The agent, Edwin Lopez, met the pilots in an airport hangar, ultimately pitching Villegas a lucrative deal to fly Maduro to a location where U.S. authorities could seize him. Even after retiring in July 2025, Lopez continued contacting Villegas through encrypted apps, including messages referencing the U.S. bounty on Maduro — raised to $50 million after Trump returned to the White House and escalated operations against Venezuela, including CIA covert actions and military strikes on suspected drug smugglers. The pilot ultimately rejected the proposal and later appeared on Venezuelan state TV alongside a top official, who praised his loyalty.", "label": "neutral", "split": "train"}
{"text": "Así se ve el huracán ‘Melissa’ grabado desde su interior La Fuerza Aérea de EE UU ha volado a través del ciclón, que ha tenido vientos de 282 km/h, para recopilar información que le permita estudiar este fenómeno", "label": "positive", "split": "train"}
{"text": "PHILADELPHIA (AP) — After waiting more than four decades to clear his name in a friend’s 1980 killing, Subramanyam Vedam was set to walk free from a Pennsylvania prison this month. Vedam and Thomas Kinser were the 19-year-old children of Penn State University faculty. Vedam was the last person seen with Kinser and was twice convicted of killing him, despite a lack of witnesses or motive. In August, a judge threw out the conviction after Vedam’s lawyers found new ballistics evidence that prosecutors had never disclosed. Tejaswini Rao chats with party guests while Subramanyam and Saraswathi Veda", "label": "negative", "split": "train"}
{"text": "Las lluvias torrenciales y las fuertes rachas de viento que han caído a lo largo de la mañana de este miércoles en las provincias de Huelva y Sevilla han provocado incidentes acompañados de imágenes que, a muchos, les ha hecho recordar la tragedia de la dana de la que justo este miércoles se cumple un año. Afortunadamente, la borrasca apenas ha causado daños físicos, un herido grave en la localidad onubense de Gibraleón, pero las intensas precipitaciones han generado alrededor de un millar de incidencias, más de la mitad solo en la capital de Andalucía, donde parte de sus barrios y avenidas pr", "label": "positive", "split": "train"}
{"text": "Versalles ha pasado a la posteridad como el peor acuerdo de paz de la historia, como un desastre cósmico del que surgieron los desastres posteriores del siglo XX. Firmado en la ciudad francesa en junio de 1919 , el tratado puso fin a la Primera Guerra Mundial; aunque la humillación a la que fue sometida Alemania sentó las bases para el nacimiento del rencor y odio que alimentaron al nazismo… Sin Versalles es difícil entender a Hitler , sin Hitler no se hubiesen producido ni la Segunda Guerra Mundial ni el Holocausto… No es la única causa, pero fue indudablemente una causa. Sin embargo, el trau", "label": "negative", "split": "train"}
{"text": "Israeli strikes in Gaza kill 104, health ministry says, after Hamas accused of killing soldier David Gritten, Jerusalem and Rushdi Abualouf, Gaza correspondent, in Istanbul Reuters Four people were killed in an Israeli strike in Nuseirat refugee camp, in central Gaza At least 104 Palestinians were killed in a wave of Israeli strikes in Gaza on Tuesday night, the territory's Hamas-run health ministry says. The Israeli military said it struck \"dozens of terror targets and terrorists\" in response to violations by Hamas of the US-brokered ceasefire deal. Israel's defence minister accused Hamas of", "label": "negative", "split": "train"}
{"text": "Al menos 64 muertos y 81 detenidos en una operación contra el narcotráfico en Río de Janeiro A massive police raid in the Alemão and Penha favela complexes in northern Rio de Janeiro on Tuesday left around 120 people dead, including four police officers, making it the deadliest police operation in the city's history. The operation targeted the Comando Vermelho (CV) criminal faction and involved 2,500 officers, helicopters, armored vehicles, and over 100 arrest warrants. Traffickers responded with gunfire, burning barricades, and drones carrying explosives, shutting down schools, hospitals, and major roads. Human Rights Watch called the operation a “huge tragedy” and urged investigations into each death and the planning behind the raid. Authorities say the goal was to capture CV leadership and stop its territorial expansion; prosecutors have charged 67 people with drug-trafficking association.", "label": "neutral", "split": "train"}
{"text": "For over two months, Paramjit Singh, 48, a US green card holder battling a brain tumour and a heart condition, has been held in a detention centre by US immigration authorities. Mr Singh, an Indian passport holder, has lived in the US on a green card since 1994. He lives in Indiana with his family, who own a chain of gas stations. His wife and two children are US citizens. But Mr Singh now faces the threat of deportation. On 30 July, he was detained by immigration authorities at Chicago O'Hare International Airport while returning from a trip to India and has since been in their custody. US Im", "label": "negative", "split": "train"}
{"text": "En pequeños grupos de tres o cinco personas y aprovechando cualquier cobertura natural, los invasores rusos tratan de colarse tras las líneas de defensa ucranianas. Una vez que alcanzan algún punto de retaguardia, esperan refuerzos mientras tratan de hacerse fuertes y atacan a los ... defensores. Aunque no siempre lo logran, sus intentonas no cesan a pesar de las bajas. El dominio absoluto de los drones vigilantes en toda la línea del frente y en especial en la ciudad de Pokrovsk no permite grandes movimientos ni de tropas, ni de blindados. Las tareas logísticas son especialmente peligrosas en", "label": "negative", "split": "train"}
{"text": "The US military killed 14 people and left one survivor in more strikes on alleged drug-trafficking boats in the eastern Pacific, the defense secretary, Pete Hegseth , said on Monday, as the Trump administration continued to expand its campaign beyond the Caribbean. The latest strikes mean the US has now attacked at least 13 vessels and brought the officially acknowledged death toll to 51 people since the campaign began at the start of September. Hegseth did not provide geographic details beyond saying that the strikes took place in the eastern Pacific, in international waters. Last week, the a", "label": "negative", "split": "train"}
{"text": "En las negociaciones para el acuerdo de paz en Gaza , participa un hombre al que Israel querría ver muerto. Jalil al Jaya, líder del buró político de Hamas, el pasado abril en Estambul Khalil Hamra / AP Se trata de Jalil al Jaya, presidente del buró político de Hamas, quien lidera la delegación palestina que ha acudido a Egipto para abordar la propuesta de Donald Trump. Él era uno de los objetivos del ataque que el ejército israelí lanzó sobre Qatar el pasado 9 de septiembre con la intención de descabezar al grupo islamista. Aquel día, Al Jaya se salvó de las bombas, pero perdió a su hijo Humm", "label": "positive", "split": "train"}
{"text": "The strongest storm to hit Jamaica since record-keeping began made landfall on Tuesday, leaving more than 530,000 residents without power. The prime minister, Andrew Holness, declared the whole island a disaster area. On Wednesday the storm headed towards Cuba, where hundreds of thousands were evacuated", "label": "negative", "split": "train"}
{"text": "Two dozen states sue White House over food stamps suspension amid shutdown This week more than two dozen states, led by New York, California, and Massachusetts, sued the Trump administration to force the U.S. Department of Agriculture to continue issuing Supplemental Nutrition Assistance Program (SNAP) benefits during the federal government shutdown. The lawsuit argues that USDA is legally required to use its roughly $6 billion contingency fund to maintain food aid for nearly 42 million Americans, despite the agency's announcement that no benefits will be issued on November 1. State attorneys general say the administration is creating unnecessary hardship and political fear, noting that SNAP costs about $8 billion per month and is the country's largest nutrition program. USDA officials claim the funds are not legally available for regular benefits, although a prior USDA shutdown plan — since removed from its website — stated Congress intended SNAP to continue during a shutdown.", "label": "negative", "split": "train"}
{"text": "Trump administration sued over $100K fee for skilled worker visas The U.S. Chamber of Commerce, which represents more than 3 million American businesses, has sued the Trump administration over a new $100,000 fee imposed on H-1B visa petitions, arguing the fee would make the program too expensive for employers and harm companies that rely on skilled foreign workers. Trump's executive order applies to new H-1B requests and requires payment before entry, with the administration calling the fee lawful and necessary to reform what it says is an abused visa system. Tech leaders, including Elon Musk, Microsoft's Satya Nadella, and Alphabet CEO Sundar Pichai—each of whom began their careers in the U.S. while on H-1B visas—criticized the move, saying the program helps the U.S. attract top global talent. Commerce Secretary Howard Lutnick defended the fee, saying companies should decide whether a worker is worth the cost or instead hire an American.", "label": "positive", "split": "train"}
{"text": "Jamaica braces for catastrophic winds and flooding as Hurricane Melissa approaches Hurricane Melissa struck southwestern Jamaica on Tuesday as a catastrophic Category 5 storm with 185-mph winds, tying records for the strongest Atlantic hurricane ever at landfall. Flooding, landslides, and widespread power outages were reported, with roughly 540,000 customers — about 77% of the island — losing electricity and nearly 15,000 people sheltering in emergency centers. Officials warned of storm surges up to 13 feet and reported hospital damage, trapped families, and roofs ripped from buildings, though confirmed deaths in Jamaica were not yet reported at landfall. The hurricane is expected to move toward Cuba next, where evacuations are underway.", "label": "neutral", "split": "train"}
{"text": "'My hopes are dashed': Illegal Indian migrants deported by US speak to BBC Kamal Saini, BBC Punjabi, Kaithal, Haryana and Avtar Singh, BBC Punjabi, Kaithal, Haryana Kamal Saini The deportation comes amid a crackdown on illegal immigrants under the Trump administration Several illegal Indian migrant workers who were recently deported from the US have recounted their ordeal to BBC Punjabi, describing humiliation, debt and shattered dreams. At least 54 men, who had entered the US through the \"donkey route\" - often used by traffickers to facilitate illegal crossings - landed in the country's capit", "label": "negative", "split": "train"}
{"text": "Actualizado Martes, 28 octubre 2025 - 22:02 Tras aceptar el alto el fuego anunciado por el presidente estadounidense, Donald Trump , y vigente a duras penas desde hace casi dos semanas, Israel y Hamas intercambian acusaciones de romperlo . Paralelamente al cruce de ataques en el terreno y de reproches ante los micrófonos de \"violaciones del alto el fuego\" que han protagonizado la jornada de este martes y, como si fuera un universo paralelo, una coalición internacional bajo la tutela de EEUU intenta apuntalar la frágil calma -este miércoles ausente- para pasar de la primera a la segunda fase. \"", "label": "neutral", "split": "train"}
{"text": "Familiares de las víctimas de la dana han gritado “asesino” y “traidor” al president Carlos Mazón cuando ha hecho entrada en la sala de celebración del Homenaje de Estado. Un grupo de familiares, que portaban camiseta negra con el mensaje “traidores, asesinos, cómplices” han gritado al presidente desde la bancada de invitados. El president se sienta en la tercera fila de autoridades, tras los ministros del Gobierno, y ha escuchado sentado la bronca, que ha ido adquiriendo intensidad. Otras familias se han unido a los gritos, otros han levantado fotografías de sus familiares en dirección al asi", "label": "positive", "split": "train"}
{"text": "El ejército israelí ha anunciado esta mañana la reanudación de la aplicación del alto el fuego tras un día con más fuego que calma. A raíz de la muerte de un soldado israelí en un ataque armado palestino a primera hora de la tarde de este martes en el sur del enclave, el ejército israelí lanzó intensas oleadas de ataques aéreos que causaron desde entonces y hasta primeras horas de la mañana de este miércoles al menos 100 palestinos muertos, incluidos 35 niños y siete mujeres, según el ministerio de Sanidad gazatí bajo control de Hamas. Israel afirma que \"en respuesta a las violaciones de la tr", "label": "positive", "split": "train"}
{"text": "Las nubes ya cubren la isla de Jamaica entera y los vientos arrecian, pero la tormenta, oficialmente, no ha llegado. El huracán Melissa , de categoría 5 en la escala Saffir-Simpson, la máxima posible, se ha ido fortaleciendo a lo largo del fin de semana mientras se mueve lentamente hacia el noreste por encima de las aguas cálidas del mar Caribe, y se espera que gracias a esas mismas aguas todavía gane más fuerza en las próximas 24 horas. Con vientos sostenidos de 280 kilómetros por hora, el ciclón es ya el más potente del mundo este año, está entre los 10 más fuertes de los que se tienen regis", "label": "neutral", "split": "train"}
{"text": "The British journalist Sami Hamdi was reportedly detained on Sunday morning by federal immigration authorities at San Francisco international airport, and the Council on American-Islamic Relations (Cair) says that action is apparent retaliation for the Muslim political commentator ’s criticism of Israel while touring the US. A statement from Cair said it was “a blatant affront to free speech” to detain Hamdi for criticizing Israel’s ongoing military campaign in Gaza while he engaged on a speaking tour in the US. A Trump administration official added in a separate statement that Hamdi was facin", "label": "negative", "split": "train"}
{"text": "Amazon has confirmed it plans to cut thousands of jobs, saying it needs to be \"organised more leanly\" to seize the opportunity provided by artificial intelligence (AI). The tech giant said on Tuesday it would reduce its global corporate workforce by \"approximately 14,000 roles\". Earlier reporting had suggested it was planning to lay off as many as 30,000 workers. Beth Galetti, a senior vice president at Amazon, wrote in a note to staff that the move would make the company \"even stronger\" by shifting resources \"to ensure we're investing in our biggest bets and what matters most to our customers", "label": "positive", "split": "train"}
{"text": "British military equipment has been found on battlefields in Sudan, used by the Rapid Support Forces (RSF), a paramilitary group accused of genocide , according to documents seen by the UN security council. UK-manufactured small-arms target systems and British-made engines for armoured personnel carriers have been recovered from combat sites in a conflict that has now caused the world’s biggest humanitarian catastrophe . The findings have again prompted scrutiny over Britain’s export of arms to the United Arab Emirates (UAE), which has been repeatedly accused of supplying weapons to the parami", "label": "negative", "split": "train"}
{"text": "U.S. lawmakers have tried four times since September last year to close what they called a glaring loophole: China is getting around export bans on the sale of powerful American AI chips by renting them through U.S. cloud services instead. But the proposals prompted a flurry of activity from more than 100 lobbyists from tech companies and their trade associations trying to weigh in, according to disclosure reports. The result: All four times, the proposal failed, including just last month. As leaders Donald Trump and Xi Jinping prepare for a long-heralded meeting Thursday, the sale of U.S. tec", "label": "negative", "split": "train"}
{"text": "A pesar de que más de un 40% de los argentinos que fueron a votar –en una elección marcada por la abstención– le ha dado el visto bueno al Gobierno en su momento más difícil, tanto por los escándalos internos como por la inestabilidad financiera , la victoria en las legislativas no implica una aprobación directa de todos los proyectos del oficialismo en el Parlamento. Es por eso que, tal y como pudo advertirse en el discurso de Milei del domingo pasado, resulta esencial para la Administración libertaria hacerse con aliados. Una de las principales puertas que ha tocado el Gobierno de Milei en l", "label": "positive", "split": "train"}
{"text": "Immigration officials have deported a father living in Alabama to Laos despite a federal court order blocking his removal from the US on the grounds he has a claim to citizenship, the man’s attorneys said on Tuesday. US district judge Shelly Dick last week ordered US Immigration and Customs Enforcement to keep Chanthila “Shawn” Souvannarath, 44, in the United States while he presented what the judge called his “substantial claim of US citizenship”, court records show. He was born in a refugee camp in Thailand but was granted lawful permanent residence in the US before his first birthday, accor", "label": "neutral", "split": "train"}
{"text": "A manhunt is underway in California after a murder suspect was accidentally released from jail last week. The Contra Costa sheriff’s office said that it was investigating the release of 20-year-old Isaiah Jamon Andrews of Kent, Washington. Andrews was released on 22 October from the Martinez detention facility in northern California. At the time of his release, Andrews had been held on local charges, a juvenile warrant out of Sacramento as well as an out-of-state arrest warrant for homicide. After staff realized that Andrews had been released, officers launched a search “of the immediate area", "label": "negative", "split": "train"}
{"text": "EL PAÍS ofrece en abierto la sección América Futura por su aporte informativo diario y global sobre desarrollo sostenible. Si quieres apoyar nuestro periodismo, suscríbete aquí . A ningún caribeño le sorprende la llegada de huracanes en octubre . En Cuba, hace días que se lanzaron los mensajes de alerta temprana, identificó zonas vulnerables y preparó un plan de reubicación en el oriente de la isla; Jamaica cerró sus aeropuertos, evacuó obligatoriamente a la población más expuesta y habilitó refugios masivos... Pero, el huracán ‘Melissa’ , que ha sido calificado por la Organización Meteorológi", "label": "positive", "split": "train"}
{"text": "El secretario de Defensa de Estados Unidos, Pete Hegseth, ha anunciado este martes en su cuenta de la red social X que el ejército lanzó el lunes tres ataques contra cuatro embarcaciones que navegaban por el Pacífico. Catorce personas fueron asesinadas en la operación, y hubo un posible superviviente aún no hallado. Hegseth afirmó, sin aportar pruebas, que las lanchas transportaban droga y que sus tripulantes pertenecían a “organizaciones terroristas designadas”. Tampoco dijo cuáles eran esas organizaciones. Con estas cuatro supuestas narcolanchas, la cuenta de embarcaciones pulverizadas por e", "label": "negative", "split": "train"}
{"text": "Actualizado Martes, 28 octubre 2025 - 20:26 La jefa de servicio de Emergencias de la Generalitat, Inmaculada Piles , ha admitido este martes ante la jueza de Catarroja que investiga la dana del 29 de octubre de 2024 que los técnicos ya trabajaban en la propuesta del ES-Alert hora y media antes de que se lanzase. El mensaje a los móviles de la ciudadanía no llegó hasta las 20.11 horas, por lo que la magistrada atribuye la mayoría de las 229 muertes a este retraso. Averiguar por qué se demoró tanto el envío de la alerta es uno de los objetivos de la jueza. La declaración de Piles, de hecho, conf", "label": "neutral", "split": "train"}
{"text": "La guerra más determinante del mundo Videorreportaje Hamas pierde pero Israel, acusado de genocidio, tampoco gana en una guerra que destruye Gaza y la posibilidad de un estado palestino Video La guerra más determinante del mundo 07/10/2025 06:00 Actualizado a 07/10/2025 16:44 La guerra de Gaza ha sido la más determinante desde la Segunda Guerra Mundial. Ha cambiado Oriente Medio, donde la causa palestina queda reducida a una reconstrucción que prima los beneficios económicos sobre las aspiraciones nacionales. Para la mayoría de países del mundo ha sido una guerra colonial y supremacista. A pes", "label": "positive", "split": "train"}
{"text": "Summary of the day so far... Today brought more concern over food assistance for millions of Americans, as states filed an emergency lawsuit to prevent SNAP benefit cuts during the ongoing government shutdown. Donald Trump continued his Asia trip with stops in Japan and South Korea, while war secretary Pete Hegseth announced the killing of 14 people in strikes against alleged drug-trafficking vessels. Here’s what else happened today: More than two dozen states and Washington DC filed an emergency lawsuit against the Trump administration seeking to prevent food stamp benefits from being cut off", "label": "negative", "split": "train"}
{"text": "Paul Biya, the world’s oldest serving head of state, has been declared the winner of Cameroon’s election, granting him an eighth term that could keep him in office until he is nearly 100. The country’s constitutional council said Biya had won 53.66% of the vote, while his former ally turned challenger, Issa Tchiroma Bakary, got 35.19%. Biya, 92, took office in 1982 and has held a tight grip on power ever since , doing away with the presidential term limit in 2008 and winning re-election by comfortable margins. “There was no election, it was rather a masquerade,” Tchiroma said after the results", "label": "positive", "split": "train"}
{"text": "A plane crash near Kenya's coast has killed 10 European tourists and a local pilot, officials have said. The aircraft was flying from the popular beach resort of Diani to an airstrip in the world-famous Maasai Mara game park when it went down at 05:30 local time (02:30 GMT), the Kenya Civil Aviation Authority (KCAA) said. Mombasa Air Safari said the plane was carrying eight Hungarians, two Germans and a Kenyan pilot, all of whom had been killed in the crash. \"Our primary focus right now is on providing all possible support to the families affected,\" it added in a statement. Local media have pu", "label": "negative", "split": "train"}
{"text": "Dónde ver Palma del Río - Betis: canal de TV y streaming online del partido de la Copa del Rey 2025-2026 Real Betis will face Atlético Palma del Río this Thursday, October 30 at 9 pm, in the first round of the 2025-26 Copa del Rey at the Estadio Sergio León in Córdoba. The match will air on Movistar Plus and Movistar LaLiga 4, with live updates on Alfinaldelapalmera.com and ABC de Sevilla. Betis, coming off a 2-0 league loss to Atlético Madrid, is expected to rotate players — giving minutes to Adrián, Ángel Ortiz, Pablo García, Llorente, and Chimy Ávila — while only Isco remains injured. Host club Palma del Río, led by former Betis striker Sergio León, competes in the Andalusian Division of Honor and expanded its stadium to 8,000 seats for the sold-out game.", "label": "neutral", "split": "train"}
{"text": "Entre las modificaciones más relevantes se incluye la posibilidad de retirar la nacionalidad a quienes la hayan obtenido de forma fraudulenta , una de las principales exigencias de Chega y que el PSD acabó aceptando tras semanas de negociación. El nuevo texto también establece que los solicitantes deberán demostrar medios de subsistencia propios y no depender de subsidios del Estado , además de tener conocimientos básicos de la lengua, la historia y la cultura portuguesa. Asimismo, se endurecen los requisitos de residencia: se exigirán diez años de permanencia legal en el país para la mayoría", "label": "neutral", "split": "train"}
{"text": "Argentina's Milei wins big in midterms with 'chainsaw' austerity Ione Wells South America correspondent in Buenos Aires AFP via Getty Images Javier Milei won nearly 41% of the vote in Argentina's midterm elections Argentina's President Javier Milei has led his party to a landslide victory in Sunday's midterm elections, after defining the first two years of his presidency with radical spending cuts and free-market reforms. His party, La Libertad Avanza, won nearly 41% of the vote, taking 13 of 24 Senate seats and 64 of the 127 lower-house seats that were contested. His gains will make it easier", "label": "positive", "split": "train"}
{"text": "La política debería ser la búsqueda de la normalidad, pero la política posmoderna es un manojo de nervios, una historia de aceleración, de vértigo, de violencia, un estado de excepción permanente en el que reinan un puñado de autócratas, encabezados por Donald Trump , que se afirman en medio del caos patrocinado por las plataformas tecnológicas . Los autócratas, además, son como los enanos del cuento de Monterroso: se reconocen en cuanto se ven. Vladímir Putin encarna una Rusia patriótica, cristiana, ortodoxa, marcial, carnívora, heterosexual y machista, y acusa a Europa de articular un proyec", "label": "neutral", "split": "train"}
{"text": "US kills 14 in strikes on four alleged drug boats in Pacific Bernd Debusmann Jr at the White House US Department of Defense One person survived the strikes and was rescued by Mexican search-and-rescue teams. US forces have killed 14 people in strikes on four alleged drug boats in the Pacific, Defence Secretary Pete Hegseth said. Mexico's navy says it is still searching for a lone survivor approximately 400 miles (643km) from the Pacific coastal city of Acapulco. It is the latest in a series of attacks on boats the US says have been carrying drugs in both the Pacific and Caribbean. The latest s", "label": "negative", "split": "train"}
{"text": "China controls the rare earths the world buys - can Trump's new deals change that? Suranjana Tewari Asia Business Correspondent Getty Images Trump with Japan's Prime Minister Sanae Takaichi US President Donald Trump has signed a flurry of deals on his Asia visit to secure the supply of rare earths, a critical sector that China has long dominated. The deals with Japan, Malaysia, Thailand, Vietnam and Cambodia differ in size and substance and it's too early to assess their tangible impact. But they all include efforts to diversify access to the minerals that have become essential for advanced ma", "label": "positive", "split": "train"}
{"text": "Solo un desalmado permanecería impasible ante el cese de los bombardeos sobre Gaza y la liberación de los rehenes israelíes . Sean cuales sean las circunstancias que han permitido lograrlo (con dos años de retraso y un enorme coste de vidas), hay motivo para celebrar. Sobre todo, por parte de los afectados. El resto (Gobiernos, mediadores, políticos, activistas, centros de estudios e incluso periodistas) haría bien en evitar el aplauso (a menudo autoaplauso) y empezar a trabajar para sortear la tormenta que anuncian los numerosos nubarrones en el horizonte . Más allá del riesgo de incumplimien", "label": "neutral", "split": "train"}
{"text": "US transportation secretary says he'll revoke $160m from California over non-citizen truck licenses U.S. Transportation Secretary Sean Duffy said he is preparing to revoke $160 million in federal funds from California and potentially strip the state of its authority to issue commercial driver's licenses, alleging California is illegally granting said licenses to non-citizens. California officials reject the claim, saying the state is complying with new federal rules that took effect on September 29 and arguing the administration has “no legitimate basis“ to withhold funds. The Department of Transportation tightened CDL rules for non-citizens last month after three fatal crashes that officials say were caused by immigrant truck drivers. A nationwide audit of commercial licenses found improperly issued licenses in multiple states, including California, Colorado, Pennsylvania, and Texas. Duffy claims California issued tens of thousands of licenses to people who should not have them and failed to enforce English-language requirements. California disputes the findings and says its CDL holders have lower crash rates than the national average.", "label": "negative", "split": "train"}
{"text": "WASHINGTON (AP) — Vice President JD Vance said Tuesday he believes U.S. military members will be paid at the end of the week, but did not specify how the Trump administration will reconfigure funding in the second-longest government shutdown. The funding fight in Washington gained new urgency this week as millions of Americans face the prospect of losing food assistance, more federal workers miss their first full paycheck and recurring delays at airports snarl travel plans. “We do think that we can continue paying the troops, at least for now,” Vance told reporters after lunch with Senate Repu", "label": "negative", "split": "train"}
{"text": "Nvidia has hit a new milestone, becoming the first company in the world to reach a market value of $5tn (£3.8tn). The US chip-maker has rapidly climbed from a niche graphics-chip manufacturer to an AI titan, as euphoria about the potential of artificial intelligence keeps driving demand for its chips and propelling its stock to record highs. The company reached a market value of $1tn for the first time in June 2023 and hit the $4tn valuation mark just three months ago . Shares in the chip-maker rose as much as 5.6% to more than $212 on Wednesday morning, boosted by investor optimism about Nvid", "label": "positive", "split": "train"}
{"text": "Reports of ethnically motivated mass killings and other atrocities are emerging from El Fasher after the paramilitary Rapid Support Forces took control of the city in Sudan’s western Darfur region over the weekend. Video released by local activists showed a fighter known for executing civilians in RSF-controlled areas shooting a group of unarmed civilians sitting on the ground at point-blank range. Different footage shared by pro-democracy activists purportedly showed dozens of people lying dead on the ground alongside burnt-out vehicles. The footage has not been verified. In a statement on Tu", "label": "negative", "split": "train"}
{"text": "C atholic parishioners rushed to deliver food boxes to immigrants too terrified to leave their homes in the California city of Coachella after federal immigration agents swept through Latino neighborhoods during the summer. Just south of Arizona’s border in Nogales, Mexico, Catholic nuns, laypeople and volunteers at the Kino Border Initiative , despite rising threats against aid workers, cook and serve two meals daily for immigrants who have been deported or lost their chances at US asylum in Donald Trump ’s crackdown. And in El Paso, Texas, about three dozen people from an interfaith group ro", "label": "negative", "split": "train"}
{"text": "En plena polémica por la publicación de sus memorias, el rey emérito, Juan Carlos I, aterrizará esta noche en Vitoria, a donde se desplaza habitualmente desde su residencia en Abu Dabi con motivo de revisiones médicas, para pasar unos días tras lo cual volará a Lisboa (Portugal), según ha avanzado El Mundo y ha confirmado este periódico. Y después acudirá a las regatas de Sanxenxo el 8 y 9 de noviembre. La visita a España de Juan Carlos I coincide con la polémica, y esperadísima, publicación de sus memorias, que verán la luz en Francia el próximo 5 de noviembre, pero que ya medios franceses ha", "label": "positive", "split": "train"}
{"text": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli Prime Minister Benjamin Netanyahu said Tuesday he has ordered the army to immediately carry out “powerful strikes” in Gaza, and Hamas responded by saying it would delay handing over the body of a hostage, putting new pressure on the tenuous U.S.-brokered ceasefire. Associated Press reporters and witnesses heard tank fire and saw explosions in various parts of Gaza, including in Gaza City and Deir al-Balah. The order for the strikes came after an Israeli official said its forces were fired upon in southern Gaza and after Hamas handed over body parts on M", "label": "negative", "split": "train"}
{"text": "Actualizado Martes, 28 octubre 2025 - 18:50 Una de las tres asociaciones de víctimas de la dana ha alzado la voz ante lo que considera un intento de \"silenciar la verdad emocional\" por parte del Gobierno al excluir a los fotoperiodistas del funeral homenaje de Estado que se celebra este miércoles en Valencia. La Associació de Víctimes DANA 29 d'octubre de 2024 , presidida por la periodista Mariló Gradolí, ha mostrado su apoyo en un comunicado a los fotoperiodistas ante las restricciones de acceso que ha impuesto la Presidencia del Gobierno , como organizadora del acto, y ha reclamado que se ga", "label": "positive", "split": "train"}
{"text": "El mundo, pendiente de un apretón de manos. La expectación alcanza cotas máximas ante el encuentro que Donald Trump y Xi Jinping mantendrán este jueves, el primero desde que el estadounidense regresara a la Casa Blanca. Un saludo que pretende superar unos meses en ... los que la tensión entre Estados Unidos y China se ha disparado a causa de sus disputas comerciales. Persiste la duda, sin embargo, de hasta qué punto abrirá este un nuevo rumbo, o si por contra tan solo supondrá un aplazamiento circunstancial de la insoslayable rivalidad entre la potencia establecida y la emergente. La anticipac", "label": "negative", "split": "train"}
{"text": "Emigrar se ha convertido en una decisión frecuente entre miles de jóvenes españoles que, ante la falta de oportunidades laborales o la búsqueda de mejores salarios , deciden comenzar de nuevo en otro país. No se trata únicamente de escapar de la precariedad , ... sino también de avanzar hacia una vida más estable , ahorrar durante algunos años o incluso reinventarse profesionalmente. Europa sigue siendo el destino preferido para quienes desean dar ese paso y, entre todos los países, Suiza ha adquirido un protagonismo destacado en los últimos años gracias a sus condiciones laborales , su estabi", "label": "positive", "split": "train"}
{"text": "Los Reyes, junto con el presidente del Gobierno, Pedro Sánchez, han mantenido un encuentro reservado con representantes de los familiares de víctimas de la dana antes del inicio del funeral de Estado en València. El saludo ha tenido lugar en una sala contigua del Museo de les Ciències alrededor de las 17.45 horas, minutos antes de que comience la ceremonia oficial, y se ha realizado sin la presencia de Carlos Mazón. Tampoco ha estado presenta la alcaldesa de València, María José Catalá. Este detalle, conocido esta misma mañana mientras el president hacía una declaración institucional, ha gener", "label": "positive", "split": "train"}
{"text": "Investigation after woman left behind by cruise ship dies on island Getty Images Lizard Island is about 250km (155 miles) north of Cairns An 80-year-old Australian woman has been found dead on a Great Barrier Reef island after being left behind by the cruise ship she was travelling on. The woman had been hiking on Lizard Island, 250km (155 miles) north of Cairns, with fellow passengers from the Coral Adventurer cruise ship on Saturday but is believed to have broken off from the group to have a rest. The ship left the island around sunset but returned several hours later after the crew realised", "label": "negative", "split": "train"}
{"text": "Mazón, en el aniversario del 29-O: “Hubo cosas que debieron funcionar mejor, debemos reflexionar” Valencian regional president Carlos Mazón marked the one-year anniversary of the October 29 flood disaster — which killed 229 people — by reading an institutional statement acknowledging that “things should have worked better” that day. He said authorities “tried to do our best in an unimaginable situation, but in many cases it was not enough,” while urging that the day not be used for political confrontation. The regional government officially declared 29 October a permanent day of remembrance and mourning across the three provinces. At a formal ceremony attended by the full cabinet and senior officials, Mazón emphasized honoring the victims' memory and the solidarity shown by society after the catastrophe.", "label": "positive", "split": "train"}
{"text": "El huracán Melissa avanza con categoría 5 de intensidad. Según la NOAA estadounidense, la tormenta provoca una “situación extremadamente peligrosa y de riesgo mortal”. El ciclón se inició en el Mar del Caribe y ha tocado tierra en Jamaica, como anticiparon los modelos horas antes. En su trayectoria probable está ahora Cuba. Así lo muestra el “modelo de conjunto” de Google Deepmind . El modelo experimental de Google —que emplea técnicas de aprendizaje automático— anticipó con éxito que el huracán tocaría tierra en Jamaica alrededor de las 18.00 (UTC). Lo hizo un poco más al oeste de lo previsto", "label": "positive", "split": "train"}
{"text": "S Korea announces lowering of tariffs as part of new US trade deal Koh Ewe, Singapore and Kathryn Armstrong, London Getty Images The meeting comes as both countries are still trying to reach a trade deal The US and South Korea have reached a broad trade deal, both countries have said following talks between their leaders. South Korea's presidential aide, Kim Yong-beom, said the two sides will reduce reciprocal tariffs from 25% to 15%, as was agreed earlier this year. South Korea will also invest $350bn in the US, including $200bn in cash investment and $150bn in shipbuilding, Kim said. US Pres", "label": "neutral", "split": "train"}
{"text": "Hurricane Melissa: a visual guide to Jamaica's strongest storm since 1851 Hurricane Melissa made landfall in Jamaica on Tuesday as a catastrophic Category 5 storm, the strongest ever recorded on the island since 1851. With sustained winds near 180 mph and moving slowly at about 7 mph, the storm is expected to linger over the country, causing catastrophic flooding, landslides, and severe structural damage. Airports shut down, evacuations were ordered, and officials warned of storm surges up to 13 feet, with concerns about damage to coastal hospitals and mass displacement. Scientists note the storm's unusually rapid intensification over abnormally warm ocean waters, linking the conditions to climate-driven ocean heating.", "label": "neutral", "split": "train"}
{"text": "Israel ha reanudado este martes los bombardeos sobre Gaza. Poco antes, la oficina del primer ministro de Israel, Benjamín Netanyahu , ordenó al ejército llevar a cabo “ataques contundentes” y de “manera inmediata” sobre la Franja, en respuesta a un ataque “de miembros de Hamás” contra tropas israelíes cerca de Rafah, en el sur del enclave palestino. El comunicado de la oficina de Netanyahu se difundió tras unas “consultas de seguridad” con su Gabinete, que Netanyahu había convocado horas antes, después de que Hamás entregara los restos de un israelí que no correspondían a ninguno de los 13 cad", "label": "neutral", "split": "train"}
{"text": "25 people die in southern Haiti after river flooded by Hurricane Melissa burst its banks, mayor says The mayor of a southern Haitian coastal town told the Associated Press that 25 people died after a river burst its banks and flooded nearby homes. Dozens of homes in Petit-Goave collapsed, and people were still trapped under rubble as of Wednesday morning, mayor Jean Bertrand Subreme said. “I am overwhelmed by the situation,” he said as he pleaded with the government to help rescue victims. Only one official from Haiti’s Civil Protection Agency was in the area, with residents struggling to evac", "label": "negative", "split": "train"}
{"text": "Más de 460 personas han muerto en una maternidad de la localidad sudanesa de El Fasher, situada en la región de Darfur y escenario de una nueva oleada de ataques por parte de las paramilitares Fuerzas de Apoyo Rápido (RSF), que mantenían un asedio sobre ... la zona desde hace año y medio. En el balance, calificado como «trágico» por la OMS, quien lo ha dado a conocer, se incluyen tanto a pacientes como a acompañantes. El director de la agencia, Tedros Adhanom Ghebreyesus, también ha denunciado el secuestro de trabajadores médicos en el Hospital Maternidad Saudí. «Todos los ataques contra la at", "label": "positive", "split": "train"}
{"text": "‘I have to get what I need right now’: Americans brace for expiry of critical food benefits Ana Faguy in Sarasota, Florida BBC Chantille Manuel has celebrated many successes over the last five years - but still struggles to put food on the table Chantille Manuel has spent the past five years transforming her life. The Florida resident has celebrated five years in recovery for addiction, she has lost more than 140lbs (64kg), and has started her own businesses, a beauty salon. Despite all these successes, Ms Manuel has struggled to put food on the table and depends on food assistance from local", "label": "positive", "split": "train"}
{"text": "A los pies del Arco de Constantino, que en el siglo IV alzó el Senado romano para conmemorar la victoria de ese emperador sobre Majencio en la batalla del Puente Milvio , el Papa ha comparecido junto a representantes de todas las religiones para ... lanzar un mensaje de paz. En el que ha sido el primer encuentro interreligioso de su pontificado, ante el representante del Patriarca de Moscú, rabinos de Israel o el ministro de asuntos religiosos de Indonesia, ha dicho que «la guerra nunca es santa, sólo la paz es santa, porque es lo que quiere Dios». Según los organizadores, el movimiento católi", "label": "positive", "split": "train"}
{"text": "Wrongfully imprisoned for more than 40 years, US man now faces deportation to India Getty Images After serving 43 years in prison for a murder he did not commit, Subramanyam \"Subu\" Vedam was finally free. New evidence had exonerated him earlier this month of the murder of his former roommate. But before he could reach his family's arms, Mr Vedam was taken into custody by US Immigration and Customs Enforcement (ICE), who want to deport him to India - a country he has not lived in since he was a baby. Now, Mr Vedam's legal team is fighting a deportation order and his family is determined to get", "label": "negative", "split": "train"}
{"text": "Trump appeals against conviction in hush-money case Donald Trump has filed an appeal seeking to overturn his May 2024 conviction in the hush-money case, arguing that presidential immunity shields him from prosecution. Trump was found guilty on 34 felony counts of falsifying business records related to reimbursing lawyer Michael Cohen for a $130,000 payment to adult film star Stormy Daniels before the 2016 election. Although a New York judge sentenced Trump to an unconditional discharge — given his impending return to the White House — Trump's lawyers call the case politically motivated and argue that key evidence should have been excluded under the Supreme Court's later ruling that presidents have broad immunity for “official acts.“ Trump's appeal will be reviewed by the New York Appellate Division, First Department.", "label": "negative", "split": "train"}
{"text": "El brazo armado del Movimiento de Resistencia Islámica (Hamás) va a posponer la entrega del cadáver de otro de los secuestrados durante los ataques ejecutados el 7 de octubre de 2023 contra Israel. El atraso se debe a los ataques de Israel en el sur ... de Gaza en respuesta a un presunto ataque de Hamás a sus tropas. Previamente, había anunciado que lo haría durante las próximas horas de este martes. En concreto, según habían indicado las Brigadas Ezeldín al Qasam en un breve comunicado publicado en su cuenta en Telegram la entrega de los restos iba a hacerse a las 20.00 horas (hora local) . H", "label": "neutral", "split": "train"}
{"text": "Actualizado Martes, 28 octubre 2025 - 15:34 Las fuerzas estadounidenses desplegadas en el Caribe sur han redoblado sus acciones en las últimas horas, pese a la cercanía del huracán Melissa , el peor del año. Al menos 14 supuestos \"narcoterroristas\" han perdido la vida en los tres \"ataques cinéticos letales\" desencadenados durante el lunes, según confirmó Pete Hegseth, secretario de Guerra. Sólo uno de los tripulantes sobrevivió al ataque . Las autoridades mexicanas coordinaron su rescate. \"Las cuatro embarcaciones eran conocidas por nuestro aparato de Inteligencia, transitaban por rutas conoci", "label": "neutral", "split": "train"}
{"text": "Actualizado Martes, 28 octubre 2025 - 22:13 Los integrantes del Comando Vermelho , una de las principales organizaciones criminales de Brasil, bloquearon este martes varias e importantes vías en Río de Janeiro, y paralizaron parcialmente la ciudad, en represalia por una operación policial que dejó 64 muertos y 81 detenidos . Al menos 50 autobuses de transporte público fueron robados y utilizados por los narcotraficantes para bloquear calles y avenidas, según informó RioOnibus, la empresa responsable del servicio. Con calles y avenidas bloqueadas por autobuses y barreras, algunas líneas de buse", "label": "neutral", "split": "train"}
{"text": "La jefa del 112 admite a la jueza de la dana que el Gobierno central le pidió a las 18.35 el envío de la alerta In testimony about Valencia's October 29, 2024 flood disaster, 112 emergency services chief Inmaculada Piles said Spain's central government asked at 6:35 pm to send an ES-Alert to residents, but the regional government didn't issue it until 8:11 pm — by which time many victims had already died. She described confusion inside Spain's emergency management center, Cecopi, with a jammed 112 line ( about 20,000 calls) and poor interpretation of raw hydrology and weather data. Her account undercuts claims of an “information blackout” and indicates the regional presidency knew the scale by midday, even as the president kept his public schedule. The judge leading the probe argues an earlier alert could have saved lives.", "label": "negative", "split": "train"}
{"text": "Responsables de los pagos en el PSOE sitúan a Koldo como la persona clave: \"Venía él, su mujer o un mensajero. Yo dejaba un sobre en la recepción de Ferraz para que pasaran a por él\" Two former administrators for the Spanish Socialist Workers' Party told Spain's Supreme Court that Koldo García, former adviser to José Luis Ábalos, was the person who routinely collected and distributed cash reimbursements for the party's Organization department. They said expenses were handed over in envelopes, sometimes picked up by García, his wife, or even a courier, without itemizing who the money was for or what the expenses were. A Civil Guard report found unexplained discrepancies and missing documentation in those expenses submitted to the court. The judge questioned the lack of controls, and the anti-corruption prosecutor asked about whether high-value €500 bills were handled. One witness, a former manager, denied it, and the other, a former secretary, said she could not recall recent cash movements.", "label": "negative", "split": "train"}
{"text": "Las autoridades de Río de Janeiro anunciaron este martes que la cifra de muertos entre los delincuentes se situaba en 60, a los que había que sumar cuatro policías. A su vez, los vecinos del barrio de Penha, en la zona norte de la ciudad, han acumulado en la calle los cadáveres de 68 personas más , supuestamente muertas durante el cruento operativo policial contra Comando Vermelho. Bajo el nombre de operación 'Contención', los policías se han desplegado en los barrios de Penha y Alemao . Llevan más de un año investigando y han emitido un centenar de órdenes de arresto. Se dirigen contra el 'Co", "label": "neutral", "split": "train"}
{"text": "Lucas de la Cal Gyeongju (Corea del Sur) Actualizado Miércoles, 29 octubre 2025 - 08:23 Donald Trump ha insinuado repetidamente la idea de extender su mandato más allá de los dos constitucionales, bromeando al respecto en mítines y provocando incluso que sus simpatizantes hayan popularizado gorras de 'Trump 2028' . En cambio, este miércoles, el presidente de Estados Unidos hizo su declaración más firme hasta ahora en lo que pareció descartar la búsqueda de un tercer mandato. El republicano, dirigiéndose a los periodistas a bordo del Air Force One durante un vuelo a Corea del Sur , respondió qu", "label": "positive", "split": "train"}
{"text": "Indian doctors in US worry higher H-1B fee may destroy rural healthcare The U.S. is considering raising H-1B visa fees to $100,000, alarming the roughly 50,000 India-trained doctors who staff underserved rural areas and rely on H-1B status. Although the Trump administration has clarified that the fee won't apply to already-issued visas, uncertainty remains for future doctors, and hospitals fear they won't be able to afford new hires. Rural communities depend heavily on foreign physicians — 1 in 4 doctors in the U.S. is foreign-trained, and many serve where American graduates refuse to work. The American Medical Association and more than 50 medical groups warn that the fee could worsen a projected 124,000-doctor shortage by 2034 and reduce access to care. Supporters say stricter immigration protects U.S. jobs, but studies show international doctors fill critical gaps rather than displace American physicians.", "label": "negative", "split": "train"}
{"text": "Russian troops are making a concerted push in eastern Ukraine and have gained a foothold in the strategic hub of Pokrovsk, Ukrainian President Volodymyr Zelensky says. Moscow's soldiers outnumber Kyiv's 8-1 in the area and Ukraine cannot match that, Zelensky added while insisting Russia had not yet \"achieved the planned result\". Russia has been trying to capture Pokrovsk for two years. The key supply and transport hub provides supplies and reinforcements to the eastern front - and it would get Moscow closer to occupying the entirety of the Donetsk region. It would also put towns of the heavily", "label": "positive", "split": "train"}
{"text": "MIAMI (AP) — The federal agent had a daring pitch for Nicolás Maduro’s chief pilot: All he had to do was surreptitiously divert the Venezuelan president’s plane to a place where U.S. authorities could nab the strongman. In exchange, the agent told the pilot in a clandestine meeting, the aviator would be made a very rich man. The conversation was tense, and the pilot left noncommittal, though he provided the agent, Edwin Lopez, with his cell number — a sign he might be interested in helping the U.S. government. Over the next 16 months, even after retiring from his government job in July, Lopez", "label": "positive", "split": "train"}
{"text": "Tight race in Dutch election as anti-Islam populist Wilders' hope of power declines Paul Kirby, Europe digital editor and Anna Holligan, Hague correspondent AFP via Getty Images Geert Wilders is facing a strong challenge from left-leader Frans Timmermans and liberal Rob Jetten Geert Wilders' anti-Islam Freedom party is facing a tight race in Wednesday's Dutch election, and even if he wins the vote his hopes of forming a new government appear minimal. Wilders was the clear winner last time Dutch voters went to the polls in November 2023, but final opinion polls ahead of voting suggest a fall in", "label": "positive", "split": "train"}
{"text": "Miles de estudiantes salen a la calle para protestar contra el 'bullying': “Esto no es un juego de niños” Thousands of students and parents marched in Seville and across Spain to protest school bullying after the suicide of Sandra Peña, a 14-year-old whose school failed to initiate anti-bullying protocols despite repeated warnings. Many teenagers at the demonstration shared their own experiences with bullying, saying that in some cases protocols worked, but in others — like Sandra's — schools minimized or ignored the abuse. Sandra's family and classmates attended, demanding accountability. Investigations are now underway by the juvenile prosecutor's office, children's rights authorities, and labor inspectors. Protesters argued that schools often prioritize their reputation over student safety and called for systemic changes so no student faces bullying alone again.", "label": "positive", "split": "train"}
{"text": "Hurricane Melissa made landfall in Jamaica on Tuesday as a category 5 storm, the US National Hurricane Center said in its latest advisory. Seven deaths have so far been attributed to Melissa in the Caribbean, all reported before the landfall. Three people were killed in Jamaica, three in Haiti and one in the Dominican Republic. More than 240,000 people in Jamaica were without power before landfall, and about a quarter of the country’s telecommunications system was offline", "label": "negative", "split": "train"}
{"text": "At least 132 killed in Rio police raid, officials say REUTERS/Ricardo Moraes Huge police raids are not unusual in Rio, but the number of fatalities in Tuesday's operation is The number of people known to have been killed in a deadly police raid in the Brazilian city of Rio de Janeiro on Tuesday has risen to 132, officials say. This is more than double the figure cited after the police operation in the favelas (poor neighbourhoods) of Alemão and Penha, in the north of Rio de Janeiro, on Tuesday. The public defender's office, which provides legal assistance to the poor, made the new death toll p", "label": "negative", "split": "train"}
{"text": "Hurricane Melissa made landfall in Jamaica as a catastrophic category 5 storm, the strongest to lash the island since record-keeping began in 1851. It moved on to Cuba and other Caribbean countries have also been affected", "label": "negative", "split": "train"}
{"text": "Actualizado Martes, 28 octubre 2025 - 20:39 Tras aceptar el alto el fuego anunciado por el presidente estadounidense, Donald Trump , y vigente a duras penas desde hace casi dos semanas, Israel y Hamas intercambian acusaciones de romperlo . Paralelamente al cruce de ataques en el terreno y de reproches ante los micrófonos de \"violaciones del alto el fuego\" que han protagonizado la jornada de este martes y, como si fuera un universo paralelo, una coalición internacional bajo la tutela de EEUU intenta apuntalar la frágil calma -este miércoles ausente- para pasar de la primera a la segunda fase. \"", "label": "neutral", "split": "train"}
{"text": "KINGSTON, Jamaica (AP) — Heavy floodwaters swept across southwestern Jamaica, winds tore roofs off buildings and boulders tumbled onto roads Tuesday as Hurricane Melissa came ashore as a catastrophic Category 5 storm, one of the strongest Atlantic hurricanes on record. Desmond McKenzie, deputy chairman of Jamaica’s Disaster Risk Management Council, urged people to seek shelter and stay indoors as the storm crosses the island. “Jamaica, this is not the time to be brave,” he said. The Jamaican government said it had done all it could to prepare as it warned of devastating damage from the stronge", "label": "negative", "split": "train"}
{"text": "El PSOE revela ahora que entregó 127.000 euros al equipo de Ábalos en \"liquidaciones\" en metálico \"no siempre individualizadas\" The Spanish Socialist Workers' Party (PSOE) told Spain's Supreme Court that all payments made by its Organization departmnet — including cash — were properly recorded in party accounts and audited. The party acknowledged spending about €1 million in cash between 2017 and 2021 and distributing €127,000 to lawmaker José Luis Ábalos's team, sometimes without itemized receipts, submitting expenses collectively instead. The PSOE said it is “possible” that Koldo García handled some of the cash distributions but insisted the money was not paid to García, Ábalos, or current Organization Secretary Santos Cerdán personally. The party stated that cash withdrawals came only from a BBVA operating account, involved no €500 bills, and denied the existence of any “Safe B” or off-the-books fund.", "label": "neutral", "split": "train"}
{"text": "Alassane Ouattara wins landslide fourth term as Ivory Coast's president Alassane Ouattara won Ivory Coast's presidential election by a landslide, securing 89.77% of the vote and a fourth term, according to provisional results from the Independent Electoral Commission. The 83-year-old ran against four lesser-known candidates after major opposition figures Laurent Gbagbo and Tidjane Thiam were barred from running. Voter turnout was low — about 50% — especially in urban centers, which observers say contributed to a largely peaceful vote compared with past elections marked by violence. Ouattara, in power since 2011, has overseen economic growth but faces accusations of cronyism and suppressing dissent.", "label": "negative", "split": "train"}
{"text": "Venezuela's Maduro says US 'fabricating war' as it deploys world's largest warship After conducting multiple airstrikes on vessels in the region, the U.S. has deployed the world's largest aircraft carrier, the USS Gerald R. Ford, to the Caribbean as part of what President Donald Trump calls a campaign against drug traffickers. Venezuelan President Nicolás Maduro accused the U.S. of “fabricating a new war“ and trying to remove him from power, as the U.S. does not recognize his 2024 reelection. The Pentagon says the deployment is meant to disrupt narcotics trafficking, though analysts note Venezuela plays only a minor role in the drug trade and argue the move signals potential regime-change pressure. Trump has openly discussed possible “land action,“ and U.S. strikes in the region have already killed at least 43 people, prompting members of Congress, both Democrat and Republican, to question the legality and authority for the operations.", "label": "negative", "split": "train"}
{"text": "Mass killings reported in Sudanese city seized by paramilitary group The Rapid Support Forces (RSF) have seized control of El Fasher in Sudan's Darfur region. Reports from activists, the UN, and Yale University's Humanitarian Research Lab indicate mass killings, summary executions, and ethnically targeted attacks against non-Arab groups including the Fur, Zaghawa, and Berti. Video and satellite imagery suggest door-to-door killings, bodies in streets, and burned civilian areas. One activist group accused the RSF of executing more than 2,000 civilians in recent days. The UN warns of “ethnically motivated violations and atrocities,“ while communications from the city have been cut, leaving families learning of loved ones' deaths through circulating execution footage. The RSF's capture of El Fasher gives the group control over all five state capitals in Darfur, marking a major turning point in Sudan's civil war and raising concerns that the country could face partition.", "label": "negative", "split": "train"}
{"text": "«Ayer llevamos a cabo otra prueba con un sistema prometedor: el vehículo submarino no tripulado 'Poseidón'», ha señalado. «Por primera vez, tuvimos éxito no solo a la hora de lanzarlo desde un submarino usando su propulsor, sino también a la hora de activar su reserva nuclear, que alimentó al vehículo durante un cierto periodo de tiempo», ha agregado, según ha informado la agencia rusa de noticias Interfax. La existencia del 'Poseidón' fue anunciada por el propio Putin en marzo de 2018 y es un proyectil de unos 24 metros de largos con capacidad para portar una cabeza nuclear y operar en parte", "label": "positive", "split": "train"}
{"text": "Argentina's Milei wins big in midterms with 'chainsaw' austerity Argentina's President Javier Milei and his party, La Libertad Avanza, won a landslide victory in the midterm elections, taking nearly 41% of the vote and gaining major increases in both chambers of Congress (13 of 24 Senate seats and 64 of 127 lower-house seats). The result strengthens Milei's ability to advance his aggressive austerity and free-market reforms — deep cuts to state spending, deregulation, and mass layoffs — which have lowered inflation and the deficit but have also led to job losses, reduced services, and economic pain for many Argentines. U.S. President Donald Trump praised Milei and tied future U.S. financial support, including a potential $40 billion lifeline, to Milei's political momentum. Supporters say Milei is restoring economic stability after decades of mismanagement, while critics warn that cuts to pensions, healthcare, and disability services are worsening poverty and unemployment. The election gives Milei a stronger mandate heading into the next political cycle, raising the stakes over whether voters will feel relief from austerity—or lose patience with the pain.", "label": "negative", "split": "train"}
{"text": "Por qué Rosalía ha elegido estas marcas de moda para el relato místico de 'Berghain' Spanish singer-songwriter Rosalía launches her new era with 'Lux' and the single “Berghain,” leaning heavily into religious and mystical symbolism — not just in lyrics, but through fashion as narrative. Fans noticed her months-long embrace of all-white looks, foreshadowing themes of purity, redemption, and transcendence. The “Berghain” video, styled with rare archival pieces by Alexander McQueen, Givenchy, Balenciaga, and emerging designers, functions like visual theology: she moves from black (pain and chaos) to gray (transition) to white (rebirth). Every garment carries symbolic weight, including McQueen's rosary-inspired sandals and a modern “nun” aesthetic in press materials. While archival fashion can feel trend-chasing for other artists, Rosalía turns it into storytelling—each outfit is a chapter in her personal myth.", "label": "positive", "split": "train"}
{"text": "Sean Duffy, the US transportation secretary, warned on Sunday that he was about make good on a threat to revoke millions in federal funds for California because he says the state is illegally issuing commercial driver’s licenses to non-citizens. In an appearance on Fox News Channel’s Sunday Morning Futures, Duffy said Gavin Newsom , California’s governor, had refused to comply with Department of Transportation rules that require the state to stop issuing such licenses and review those already issued. “So, one, I’m about to pull $160m from California ,” Duffy said. “And, as we pull more money,", "label": "negative", "split": "train"}
{"text": "Russian forces gain foothold in strategic Ukrainian town Russia is intensifying its offensive in eastern Ukraine and has gained a foothold in the key logistics hub of Pokrovsk, according to Ukrainian President Volodymyr Zelensky. He said Russian troops outnumber Ukrainian forces roughly 8-to-1 in the area, with about 200 Russian soldiers now inside the city, though he denied claims that Ukrainian troops are fully encircled. Russia's defense ministry says its forces have surrounded Ukrainian units near the main railway station and cleared one district, while Ukraine says it has repelled 79 attacks around Pokrovsk since Monday. The battle is complicated by drone warfare and bad weather that limits Ukraine's visibility. Zelensky urged European allies for long-term financial support and said he hopes upcoming talks between Donald Trump and China's Xi Jinping will push China to scale back support for Russia.", "label": "negative", "split": "train"}
{"text": "Confederate statue torn down during anti-racism protests reinstalled in Washington President Donald Trump ordered the reinstallation of statue of Confederate Gen. Albert Pike in Washington, D.C., which had been torn down by racial-justice protesters in 2020 after the killing of George Floyd. The National Park Service says it returned the restored 1901 statue under Trump's executive order to “restore” historical monuments. Democratic Delegate Eleanor Holmes Norton condemned the move as “offensive,” arguing Pike served dishonorably against the U.S. and that Confederate statues belong in museums, not public parks. Pike's statue had long been controversial — local officials had tried for decades to remove it — and it was the only Confederate general monument in the U.S. capital prior to its toppling. Trump has directed the return of Confederate statues and paintings since returning to office.", "label": "negative", "split": "train"}
{"text": "Hurricane Melissa has made landfall in Jamaica, where sheltering residents braced themselves against ferocious winds, heavy flood waters and landslides from the category 5 storm, one of the strongest Atlantic hurricanes in history. Videos and photographs published by local newspapers painted a devastating portrait of the impact: roads transformed into raging rivers , downed power lines and trees, and roofs ripped off buildings by the power of the winds. “Hurricane Melissa is wreaking absolute havoc on Jamaica’s breadbasket parish,” the Jamaica Observer reported from St Elizabeth in the south-w", "label": "negative", "split": "train"}
{"text": "Mario Guevara has said he may have been “the first” immigrant journalist whom Donald Trump’s administration deported from the US while working – but the Emmy award-winner added: “I don’t think [I’ll] be the only one.” “Just be careful because [immigration agents are] very aggressive,” Guevara recently said from El Salvador in a virtual interview with the US Freedom of the Press Tracker , during which he was asked whether he had any message for other immigrant colleagues in the industry. “They showed they are – they don’t care about journalists. They don’t believe in the media.” He continued: “", "label": "positive", "split": "train"}
{"text": "'Storm of the century': record-breaking Hurricane Melissa hits Jamaica Hurricane Melissa made landfall in Jamaica as a Category 5 storm, the strongest to ever hit the island since record-keeping began in 1851. The storm caused catastrophic flooding, landslides, widespread power outages, and structural failures, prompting Prime Minister Andrew Holness to declare Jamaica a disaster area. Melissa's sustained winds reached around 185 mph, knocking out power to major parishes and damaging hospitals as residents sheltered from flying debris and rising waters. Scientists say the storm's explosive intensification is linked to unusually warm ocean temperatures driven by climate change. The hurricane is expected to move next toward Cuba and the Bahamas.", "label": "neutral", "split": "train"}
{"text": "Hurricane Melissa has slammed into Cuba after leaving parts of neighbouring Jamaica broken and reeling from ferocious winds and extreme rainfall. The most intense tropical cyclone to hit Jamaica in nearly two centuries, Melissa is one of the strongest Atlantic hurricanes observed since record-keeping began. Climate scientists say human-caused global heating has contributed to the rapid intensification of modern-day storms . Many Jamaicans woke up on Wednesday without power, with reports of whole neighbourhoods submerged. The prime minister, Andrew Holness, has declared the country a disaster a", "label": "negative", "split": "train"}
{"text": "Venezuela's Maduro says US 'fabricating war' as it deploys world's largest warship Kayla Epstein and Josh Cheetham, BBC Verify The USS Gerald R Ford, the world's largest warship, can carry up to 90 aircraft Venezuela's President Nicolás Maduro has accused the US of \"fabricating a new war\", after it ordered the world's largest warship to be sent to the Caribbean. The USS Gerald R Ford can carry up to 90 aircraft and its deployment marks a massive increase in US firepower in the region. The US has conducted 10 air strikes on vessels in the area as part of what it says is a war on drug trafficker", "label": "negative", "split": "train"}
{"text": "Actualizado Miércoles, 29 octubre 2025 - 11:52 El ex ministro José Luis Ábalos ha alegado ante el Tribunal Supremo que la palabra \"folios\" que la Guardia Civil traduce como dinero son, literalmente, folios porque tiene \"la costumbre de imprimir documentos\". Así consta en uno de los escritos presentados por su defensa ante el magistrado Leopoldo Puente . El reciente informe patrimonial de la UCO sobre el ex número tres del PSOE afirmaba que Ábalos \"habría recibido fondos en efectivo\" en su despacho y en su casa por parte de Koldo García y que \"las necesidades manifestadas en este sentido por el", "label": "positive", "split": "train"}
{"text": "WASHINGTON (AP) — Defense Secretary Pete Hegseth announced Tuesday that the U.S. military has carried out strikes in the eastern Pacific Ocean on four boats accused of carrying drugs, killing 14 people and leaving one survivor in the deadliest single day since the Trump administration began its divisive campaign against drug trafficking in the waters off South America. It was the first time multiple strikes were announced in a single day as the pace of the attacks has escalated. The nearly two-month campaign and U.S. military buildup have strained ties with allies in the region and opened spec", "label": "negative", "split": "train"}
{"text": "Viktor Orban's dilemma - Russian oil or Trump's favour Nick Thorpe Budapest correspondent Reuters \"There is a war-opposing network in the world, with two focal points: one of power led by the US president and one of spirit found here with the Holy Father,\" Viktor Orban said on Monday after meeting Pope Leo at the Vatican. \"We draw strength, motivation, and blessing from both,\" said the Hungarian prime minister. If his ally in the White House, US President Donald Trump, was on his mind, then his thoughts could well have turned to a tricky meeting that awaits him next week in Washington. The man", "label": "positive", "split": "train"}
{"text": "Senate Democrats , led by Adam Schiff of California , are calling for full disclosure on how Donald Trump ’s planned White House ballroom is being financed. The effort follows the release of a donor list showing that wealthy individuals and corporations, many with business before the federal government, have contributed to the project. Democrats argue that without transparency, the financing of the ballroom could become a channel for improper influence within the administration. Major companies in the tech, defense and crypto industries are helping Trump fund his $300m ballroom, for which the", "label": "positive", "split": "train"}
{"text": "En un momento en el que el Gobierno de Pedro Sánchez sigue remoloneando en cuanto al traspaso y el rescate de la principal autopista gallega , llega al menos una buena noticia para algunos de los siempre sufridos conductores que frecuentan la AP-9: el ... Tribunal Supremo ha condenado a la concesionaria, Audasa, a devolver el importe de los peajes cobrados a los usuarios durante las retenciones más graves registradas durante las obras del puente de Rande. La resolución del Alto Tribunal ha llegado después de un largo periplo con suerte dispar por varias instancias judiciales. Todo partió de un", "label": "positive", "split": "train"}
{"text": "Este texto es una transcripción de las palabras pronunciadas por Javier Cercas antes de la cena de los intervinientes en el foro World in Progress Barcelona, organizado por el Grupo Prisa, EL PAÍS y la Cadena SER. Buenas noches. Siguiendo una tradición inaugurada el año pasado , Joseph Oughourlian me pide que diga unas palabras antes de que nos sirvan la cena, unas palabras que esta vez versarán sobre un concepto que acuñé hace tiempo en un libro titulado Anatomía de un instante: los héroes de la traición. Naturalmente, esa expresión es un oxímoron, una contradicción en términos, como “matrimo", "label": "positive", "split": "train"}
{"text": "29/10/2025 Actualizado a las 18:23h. Doña Letizia ha estado consolando y escuchando atentamente durante varios minutos a Toñi García, que perdió en la barrancada aquel trágico 29 de octubre a su marido y a su hija: «Se merecen memoria por esa muerte tan indigna, por ese dolor que lleva ... la sociedad valenciana », ha afirmado en alguna ocasión a este medio y siempre ha insistido en que va a luchar por la familia que ha perdido y por «todas aquellas personas que no tengan fuerza». Su marido, Miguel Carpio, era funcionario de la Generalitat Valenciana y su hija, Sara Carpio era enfermera. Aquel", "label": "positive", "split": "train"}
{"text": "World's oldest serving head of state declared winner in Cameroon election Cameroon's 92-year-old president, Paul Biya, has won reelection with 53.7% of the vote, extending his rule into an eighth term that could see him in power until nearly the age of 100. Challenger Issa Tchiroma Bakary, who received 35.2%, rejected the result as a “masquerade,“ claiming he actually won based on tallies his campaign collected. The election results sparked protests, clashes with security forces, and reports of internet restrictions and bans on public gatherings in major cities. Biya, in power since 1982 and having removed term limits in 2008, has long maintained tight control over the Central African nation through repression of opposition and unrest.", "label": "negative", "split": "train"}
{"text": "Sikh man with tumour held by US immigration denied medical care - family Paramjit Singh, 48, a U.S. green-card holder from Indiana with a brain tumour and heart condition, has been detained by ICE for over two months after being stopped at Chicago O'Hare on July 30 and moved to a Clay County detention center. Authorities say Singh was detained for a 1999 conviction after using a public phone without paying — for which Singh served 10 days and paid a $4,137 fine — and an alleged 2008 forgery case, which authorities cited to stay Singh's release on a $10,000 bond granted by an immigration judge. His family and lawyer say there are no active charges against him and call it a case of mistaken identity. His attorney, Louis Angeles, says Singh “is not getting the medical help he needs,“ and Singh's family complains about limited contact and a delayed second brain-tumor surgery. Singh's case is set for October 14, amid a broader Trump-era immigration crackdown that critics say is sweeping up long-time residents, citing the recent deportation of 73-year-old Harjit Kaur as an example.", "label": "negative", "split": "train"}
{"text": "Baldoví tacha de “infame” la declaración institucional de Mazón: “La única que esperamos es el anuncio de su dimisión” El síndic de Compromís en Les Corts, Joan Baldoví, ha tachado de “absolutamente infame” la declaración institucional del president de la Generalitat, Carlos Mazón, con motivo del primer aniversario de la dana del 29 de octubre de 2024 que arrasó buena parte de la provincia de Valencia, donde dejó 229 víctimas mortales. “La única declaración institucional de Mazón que estamos esperando los valencianos y las valencianas es el anuncio de su dimisión inmediata”, ha expresado Baldo", "label": "positive", "split": "train"}
{"text": "The US government shutdown stretched into its 28th day with no resolution in sight on Tuesday, as the Senate remained deadlocked over spending legislation even as a crucial food aid program teeters on the brink of exhausting its funding. For the 13th time, Senate Democrats blocked a Republican -backed bill that would have funded federal agencies through 21 November. The minority party has refused to provide the necessary support for the bill to clear the 60-vote threshold for advancement in the Senate because it does not include funding for healthcare programs, or curbs on Donald Trump ’s cuts", "label": "negative", "split": "train"}
{"text": "01:22 El temporal azota Sevilla: las imágenes de las intensas lluvias en la provincia con aviso naranja", "label": "neutral", "split": "train"}
{"text": "Leo Harlem sorprende en 'El Hormiguero' al anunciar su 'jubilación': 'Necesito parar un poquito y ponerme bien de salud' Spanish comedian Leo Harlem returned to the TV show 'El Hormiguero' as part of its special programming celebrating 3,000 episodes. He showed off a theater award he had just received and used the moment to highlight the value of comedians in entertainment. During the interview, host Pablo Motos asked him if it was true that Harlem is retiring. Harlem confirmed that starting January 1 he will slow down professionally, leaving behind his hectic touring life. Instead, he plans to focus on a single project, 'Leo Talks,' and enjoy a calmer stage of life. Nearing age 63, he joked that even his suitcase “needs a rest” after years of constant travel. He won't disappear entirely; he'll still participate in charity shows. He also wants to explore new hobbies: learning electric guitar (depending on the electricity bill, he joked) or returning to drawing and painting classes.", "label": "positive", "split": "train"}
{"text": "Texas attorney general sues Tylenol makers over autism claims Texas Attorney General Ken Paxton sued Tylenol makers Johnson & Johnson and Kenvue, alleging the companies hid risks that the popular over-the-counter medication poses to children's brain development and falsely marketed it as safe for pregnant women. The lawsuit follows Donald Trump's recent promotion of an unproven link between Tylenol use during pregnancy and autism, though medical groups, including the American College of Obstetricians and Gynecologists, say no credible evidence supports such a link. Kenvue says the claims are misinformation, and the FDA has stated that a causal relationship between acetaminophen and autism has not been established. Paxton seeks to block the companies from advertising Tylenol as safe for pregnant women, echoing a similar 2022 lawsuit that was dismissed for lack of scientific proof.", "label": "negative", "split": "train"}
{"text": "A Rosalía le gusta la simbología casi tanto como la música. En cuestión de horas, las redes sociales se han llenado de teorías sobre los significados ocultos en Berghain , la primera canción revelada de su nuevo disco Lux , y que funciona como una especie de tráiler del relato que da forma al álbum: una especie de redención mística en el que el dolor convive con la pureza y lo terrenal con lo trascendente. En los últimos meses, el hecho de que Rosalía vistiera de blanco alertó a sus fans de que lo religioso, entendido en sentido amplio, sería el leit motiv de su nueva era. Porque desde Motomam", "label": "neutral", "split": "train"}
{"text": "Israel bombardea Gaza después de acusar a Hamás de atacar a sus tropas Israel resumed air strikes on Gaza on Tuesday after Prime Minister Benjamin Netanyahu ordered “immediate” and “forceful” attacks following an assault on Israeli troops near Rafah and the delivery of remains that did not match the list of 13 hostages still unreturned. Health authorities said the renewed strikes killed at least eight people (three in Gaza City and five in Khan Yunis), while Israel's defense minister Israel Katz vowed “Hamas will pay a high price for attacking soldiers of the Israeli Defense Forces in Gaza.” Hamas denies attacking Israeli forces since the ceasefire began on October 10. The International Committee of the Red Cross criticized Hamas over footage suggesting it staged the recovery of one body, while Hamas says it remains committed to the ceasefire while blaming Israeli violations for delaying further handovers. U.S. officials signaled limited public pushback. Vice President J.D. Vance said “the ceasefire is holding” and Secretary of State Marco Rubio affirmed Israel's right to self-defense, while President Trump warned Hamas to return bodies quickly or face consequences.", "label": "negative", "split": "train"}
{"text": "Government accountability organization accuses agriculture secretary of unlawfully refusing to use emergency fund created to prevent food stampt disruptions during shutdowns A government accountability organization has accused agriculture secretary Brooke Rollins of unlawfully refusing to tap a $5bn emergency fund that Congress specifically created to prevent food stamp disruptions during government shutdowns. The Democracy Defenders Fund sent a letter to Rollins arguing that the USDA is legally obliged to use the SNAP contingency fund to continue benefits for 42 million Americans, warning tha", "label": "negative", "split": "train"}
{"text": "Actualizado Martes, 28 octubre 2025 - 19:36 La Policía de Río de Janeiro lanzó este martes una gran operación en dos favelas con el objetivo de arrestar a los cabecillas del Comando Vermelho , la mayor facción criminal de la ciudad brasileña, y de frenar su expansión territorial .La operación en los complejos de Penha y de Alemão, dos grupos de favelas, desembocó en tiroteos y en el levantamiento de barricadas, lo que causó al menos 64 muertos, cuatro de ellos policías, durante las acciones y decenas de personas fueron detenidas, según medios locales. Asimismo, los agentes detuvieron, hasta ah", "label": "negative", "split": "train"}
{"text": "The United States has destroyed at least 14 boats in international waters as part of a Trump administration crackdown on alleged drug trafficking. The strikes carried out against targets in both the Pacific Ocean and Caribbean have killed at least 57 people. The BBC's White House reporter Bernd Debusmann Jr explains what the US has said about the military operation and highlights concerns raised by legal experts and some Democratic and Republican lawmakers. Video by Blanca Estrada", "label": "negative", "split": "train"}
{"text": "Noche lluviosa, trámite incómodo que cumplir y superioridad que imponer. El Sevilla se consiguió imponer este martes en el Salto del Caballo de Toledo para avanzar hacia la segunda ronda de la Copa del Rey. El equipo dirigido por Matías Almeyda hizo valer su incontestable ... calidad técnica en un duelo que enfrentaba a dos clubes que compiten en dos realidades bien distintas. No obstante, la relajación inicial de los nervionenses hizo que ahora que se aproxima Halloween, los sustos no se quedaran sin hacer acto de presencia en la noche toledana. Poco importa que haya varias categorías de dife", "label": "negative", "split": "train"}
{"text": "Some of the earliest written notes in western musical history discovered in Pennsylvania Researchers examining a ninth-century vellum manuscript in a private collection discovered what they believe are some of the earliest written musical notations in Western history. The markings—dots and characters written above the word “alleluia“ in a Latin sacramentary used during Easter mass—appear to guide singers on pitch rises and falls. Historian Nathan Raab, who identified the notations, says the document may predate other early Western music manuscripts such as the Laon Gradual and the St. Gall Cantatorium. If confirmed, it would be one of the earliest known examples of Western musical notation and the oldest such example in private hands.", "label": "neutral", "split": "train"}
{"text": "Todas las miradas se dirigieron a los mediadores y, sobre todo, a Donald Trump , la persona que impulsó el acuerdo y dejó claro que «la guerra ha terminado». Fuentes estadounidenses citadas por el canal Al Yasira aseguraron que, pese a esta nueva crisis, «el acuerdo sigue vigente en Gaza, y seguimos trabajando para implementar el plan de paz del presidente Trump. La transición hacia una paz permanente en Gaza es una tarea difícil tras dos años de conflicto en la Franja». El terror volvió a apoderarse de los vecinos de Gaza tras conocer la orden de Netanyahu, que se produjo al final de una jorn", "label": "negative", "split": "train"}
{"text": "Grave fears for civilians after Sudanese paramilitary claims capture of El Fasher The Rapid Support Forces (RSF) claim to have captured El Fasher, the last major army-held city in Sudan's Darfur region, deepening fears for the hundreds of thousands of civilians trapped there after more than a year under siege. The army and local militias insist they are still resisting, but reports indicate fighters have pushed deeper into the city, cut off escape routes, and may be killing civilians trying to flee. Humanitarian agencies warn that about 260,000 people remain trapped without aid, amid telecommunications blackouts and credible allegations of executions, artillery strikes on shelters, and arrests of journalists. If confirmed, the fall of El Fasher gives the RSF control over all five Darfur states, raising the possibility of Sudan's effective partition. News of El Fasher's capture comes amid accusations that foreign governments are fueling the conflict with weapons.", "label": "negative", "split": "train"}
{"text": "Texas Attorney General Ken Paxton is suing the makers of Tylenol, claiming the companies hid alleged dangers that the drug posed to children's brain development. The lawsuit comes a month after President Donald Trump promoted an unproven link between taking Tylenol - also known as paracetamol - during pregnancy and autism in children. Paxton is suing Johnson & Johnson, which previously sold the drug, the only pain reliever recommended for pregnant women, and Kenvue, which now manufacturers it. In a statement, he said they \"betrayed America by profiting off of pain and pushing pills regardless", "label": "negative", "split": "train"}
{"text": "Pedro García Cuartango Hay en la sociedad una resurrección del debate sobre Dios, que es tanto como decir sobre el sentido de la vida y sobre qué somos y por qué estamos aquí", "label": "neutral", "split": "train"}
{"text": "Trump administration will revamp ICE leadership in quest to intensify deportations The Trump administration is planning a leadership shake-up at Immigration and Customs Enforcement (ICE) to accelerate mass deportations, according to reports from multiple outlets. The White House is reportedly frustrated that ICE is arresting far fewer immigrants than goals set by senior adviser Stephen Miller — about 1,178 per day versus the target of 3,000, and well below Trump's pledge to deport 1 million people in his first year. NBC News reports that “at least a dozen“ ICE field office directors could be reassigned and replaced with Border Patrol officials. Border Patrol has recently faced criticism for aggressive operations, including a Home Depot parking-lot raid in Los Angeles and an incident where an agent shot a U.S. citizen in Chicago. The Department of Homeland Security said only that it is “laser focused on results“ and has no personnel changes to announce yet.", "label": "negative", "split": "train"}
{"text": "Ataques aéreos de Israel en la Franja de Gaza tras los disparos contra sus tropas y la ddevolución errónea de los restos de un rehén Israel briefly resumed airstrikes in Gaza on Tuesday after a Palestinian armed attack in Rafah killed an Israeli reservist, triggering strikes that the Gaza Health Ministry says left at least 100 Palestinians dead, including 35 children and 7 women. Israel said it targeted “dozens of terror sites” in response to what it called Hamas violations of the Trump-brokered ceasefire, while Hamas and Islamic Jihad accused Israel of breaking the truce first. The clashes led Hamas to cancel the planned handover of another Israeli hostage, keeping the remaining total at 13, after earlier exchanges that saw 20 hostages returned and 250 Palestinian prisoners released. U.S. officials, including Vice President J.D. Vance, insist the ceasefire remains in effect and said Washington was notified in advance of Israel's military response. Israel's government faces internal pressure to abandon the ceasefire, but officials admit military actions now require approval from the Trump administration, which is overseeing the truce.", "label": "negative", "split": "train"}
{"text": "El galardón, que concede el Ministerio de Cultura desde 1984, reconoce el conjunto de la obra literaria de un autor vivo y está dotado con 50.000 euros. Atencia, nacida en Málaga en 1931 y figura clave del grupo poético de los años 50, ha sido premiada por una obra que, según el jurado, «posee y recrea la esencia de la vida ». Este premio se suma a otros grandes reconocimientos en su carrera, como el Premio Reina Sofía de Poesía Iberoamericana. La Diputación de Málaga ha sido una de las primeras en reaccionar, calificando a Atencia como «una voz imprescindible de la poesía española que llena d", "label": "positive", "split": "train"}
{"text": "Hurricane Melissa makes landfall in Jamaica - video Hurricane Melissa made landfall in Jamaica on Tuesday as a Category 5 storm, according to the U.S. National Hurricane Center. Before landfall, seven storm-related deaths were reported across the Caribbean — three in Jamaica, three in Haiti, and one in the Dominican Republic. More than 240,000 people in Jamaica lost power, and about 25% of the country's telecommunications system was offline.", "label": "neutral", "split": "train"}
{"text": "Wrongfully imprisoned for more than 40 years, US man now faces deportation to India Subramanyam “Subu“ Vedam, who spent 43 years in prison for a murder he did not commit, was exonerated and released, only to be immediately detained by U.S. immigration authorities, who plan to deport him to India under a decades-old deportation order. Vedam was convicted in the early 1980s of murdering his former roommate despite no physical evidence, but new evidence led prosecutors to drop the case this month. ICE argues the deportation order still applies because a separate drug conviction from the 1980s remains on his record. Vedam's family and lawyers say he has lived in the U.S. since infancy, has no meaningful ties to India, and that deportation after his wrongful imprisonment would be “another terrible wrong.“", "label": "negative", "split": "train"}
{"text": "With just one week before California voters are set to head to the polls to decide on the state’s redistricting proposal, Gavin Newsom sent an unexpected message to would-be donors: keep your money. “We have hit our budget goals and raised what we need in order to pass Proposition 50. You can stop donating,” the California governor said in an email. In 10 weeks, the campaign to support Proposition 50, which seeks to give Democrats more seats in the House in response to recently passed gerrymandered maps in Texas , raised $38m from about 1.2m “small-dollar donations”, the governor said. The cam", "label": "neutral", "split": "train"}
{"text": "The two Russian mobsters convicted in an international assassination plot targeting the Iranian-American dissident Masih Alinejad were sentenced to 25 years in prison in a New York courtroom on Wednesday. Rafat Amirov and Polad Omarov were found guilty in Manhattan federal court this March of charges including murder-for-hire and attempted murder in aid of racketeering. Iran has targeted Alinejad for years because of her advocacy for women’s rights and unflinching criticism of the regime. Alinejad, who in addition to her activism is a journalist and author, has publicized Tehran’s human rights", "label": "negative", "split": "train"}
{"text": "Daniel Viaña Corresponsal Bruselas Actualizado Martes, 28 octubre 2025 - 20:18 Rusia sigue aumentando sus amenazas sobre Europa. Este martes, con apenas unos minutos de diferencia, el secretario general de la OTAN, Mark Rutte, y la presidenta de la Comisión Ursula Von der Leyen, han señalado dos nuevas herramientas de ataque. \" Investigaciones biológicas secretas \" y \"su programa de armas biológicas, que puede utilizar contra sus adversarios\", ha asegurado el primero; la utilización de globos meteorológicos en la frontera entre Bielorrusia y Lituania, ha añadido la segunda, que no ha dudado en", "label": "positive", "split": "train"}
{"text": "The US has placed sanctions on Colombia's President, Gustavo Petro, accusing him of failing to curb drug trafficking and allowing cartels to \"flourish\". The decision is the latest in a growing diplomatic dispute between the Latin American nation's first left-wing leader and his US counterpart Donald Trump. The two have clashed over US strikes on boats it says are being used to smuggle drugs, killing dozens including some Colombian nationals. Trump has said other nations had failed to stop the boats, while Petro has accused him of \"murder\". Colombia was once a close ally of Washington's war on", "label": "negative", "split": "train"}
{"text": "El PSOE de Castilla-La Mancha ha iniciado este martes en Talavera de la Reina la campaña 'La Vivienda por el buen camino', una serie de actos centrados en las políticas de vivienda impulsadas por el Gobierno de Emiliano García-Page, con el ... objetivo de acercar a la ciudadanía las principales medidas puestas en marcha por el Ejecutivo autonómico. El consejero de Fomento, Nacho Hernando, ha sido el encargado de inaugurar este ciclo, donde ha defendido la necesidad de una intervención seria en el mercado de la vivienda. «Lo que hemos planteado en el Debate del Estado de la Región son diez medi", "label": "positive", "split": "train"}
{"text": "Brigitte Macron's life 'deteriorated' after alleged cyber-bullying, daughter says The stepdaughter of French President Emmanuel Macron testified in a Paris court that online conspiracy theories falsely claiming her mother is transgender have harmed the French First Lady's health, daily life, and family. The case involves 10 defendants — including an elected official, an independent journalist, and an online fortune-teller — accused of spreading unsubstantiated claims about Brigitte Macron's gender and sexuality. Prosecutors are seeking suspended prison sentences of three to 12 months and fines up to €8,000. Tiphaine Auzière, 41, said the harassment has worsened her mother's well-being, forced her to scrutinize her appearance, and led to her grandchildren being taunted at school. The Macrons plan to present evidence proving the First Lady is a biological woman in a case against U.S. influencer Candace Owens.", "label": "neutral", "split": "val"}
{"text": "La educación, la mayor prioridad tras la tregua en Gaza: \"Miles de niños han sido privados de su niñez\" More than 500,000 children in Gaza have been displaced during two years of war, and about 64,000 have been killed or injured, according to UN data. UNICEF officials in Gaza say at least 58,000 children are now “unaccompanied,” having lost one or both parents, and 90% show signs of PTSD after repeated displacement and trauma. The ceasefire declared on October 10 has allowed humanitarian groups to assess damage: 85% of schools are destroyed or unusable, and many remaining buildings are being used as shelters. Temporary learning centers currently reach 100,000 children, but materials are scarce and education is largely absent from incoming aid shipments. UNICEF warns that restoring education and psychological support is critical, as Gaza's children face an uncertain future in a largely uninhabitable enclave.", "label": "negative", "split": "val"}
{"text": "DEIR AL-BALAH, Gaza Strip (AP) — Israel’s military said Wednesday that the ceasefire was back on in Gaza after it carried out heavy airstrikes overnight across the Palestinian territory that killed 104 people, including 46 children, according to local health officials. The strikes, the deadliest since the ceasefire began on Oct. 10, marked the most serious challenge to the tenuous truce to date. The bombardment pointed to Israel’s readiness to strike hard at what it says are Hamas violations of the ceasefire deal. Meanwhile the militant group denies it is responsible and blames Israel for viol", "label": "negative", "split": "val"}
{"text": "Actualizado Martes, 28 octubre 2025 - 14:47 El PSOE ha presentado un escrito ante el Tribunal Supremo mediante el que asegura que \"todos los pagos efectuados, tanto en efectivo como por transferencia, se encuentran debidamente incorporados a la contabilidad del partido\". De esta forma defiende la legalidad de las entregas de dinero en metálico que la Guardia Civil ha puesto bajo sospecha al detectar que algunas de ellas carecen de soporte documental. El PSOE admite haber destinado en torno a un millón de euros al pago de gastos en efectivo y que repartió 127.000 euros entre el equipo de José L", "label": "positive", "split": "val"}
{"text": "Y no unas cualquiera, sino las de un espacio de más de 3.000 metros cuadrados que combina exposición, laboratorio, almacén y taller de reparación de arte tecnológico. Un modelo de institución que, pese a su ubicación periférica, en un polígono industrial a las afueras de Reus, merece estar en el centro del mapa cultural contemporáneo. La exposición inaugural, 'Hello World!', funciona como saludo y declaración de intenciones. El título, tomado del primer mensaje que imprime un programa informático cuando el código ha sido correctamente ejecutado, condensa bien el espíritu del proyecto: un comie", "label": "neutral", "split": "val"}
{"text": "China controls the rare earths the world buys - can Trump's new deals change that? During his trip to Asia this week, U.S. President Donald Trump signed multiple deals with Japan, Malaysia, Thailand, Vietnam, and Cambodia to secure rare earth minerals and reduce U.S. dependence on China, which controls roughly 70% of global rare earth processing. The agreements range from investment commitments to preferential export rules favoring U.S. buyers, though many are non-binding and thin on details. The U.S. also recently struck an $8.5 billion cooperation deal with Australia to help build refining capacity outside China. Experts say diversifying rare earth supply chains will take years and require massive investment and strict environmental regulation, since processing rare earths is costly and highly polluting.", "label": "negative", "split": "val"}
{"text": "Moncloa se conjura tras el portazo de Puigdemont que deja a Sánchez sin mayoría para gobernar: 'Vamos a seguir lo que queda, hasta 2027' Former Catalan President Carles Puigdemont announced that his center-right pro-independence party, Together for Catalonia (shortened to “Junts” in Catalan) is cutting ties with Spain's ruling Socialist Workers' Party, but without ending the government. The Spanish prime minister's office frames it as “damage control,” arguing that the reality remains largely the same: the government must negotiate every vote, one by one, with no guaranteed majority. After losing both Junts and the democratic-socialist Podemos over the past two years, Spain's ruling coalition now faces what the Basque Nationalist Party calls a “negative majority,” and chances of passing new national budgets are nearly extinct. Despite this fragility, the government insists it will finish the term through 2027 and continues to offer Junts an open hand, highlighting dialogue and agreements already fulfilled. Ministers publicly stress that the coalition is still governing — having won 88% of parliamentary votes so far — and push the narrative that the agenda will move forward through negotiation.", "label": "neutral", "split": "val"}
{"text": "La única vida que se atisba en Sheyaia, en el norte de Gaza, son dos perros vagabundos. Se mueven entre las ruinas de lo que en su momento fue un ajetreado suburbio de la capital con más de 90.000 habitantes. Hoy parece un paisaje lunar , una alfombra de escombros hasta donde alcanza la mirada que, sin embargo, dos soldados israelíes vigilan atentos con el ojo en la mirilla de los rifles. Están apostados en un alto estratégico dentro de Gaza al que ha accedido este periódico, empotrado con las Fuerzas Armadas de Israel, en la primera vez que un grupo de periodistas extranjeros ingresa al encla", "label": "negative", "split": "val"}
{"text": "Al menos 460 pacientes y acompañantes han sido asesinados en un ataque sobre el Hospital Materno Saudí de El Fasher, una ciudad de Darfur del Norte (Sudán) tomada por las paramilitares Fuerzas de Apoyo Rápido (RSF, por sus siglas en inglés) desde el fin de semana pasado, según ha denunciado este miércoles la Organización Mundial de la Salud (OMS). La cifra de fallecidos la ha aportado el director general de la agencia sanitaria de la ONU, Tedros Adhanom Ghebreyesus, en su cuenta oficial en la red social X (antes Twitter) . La organización que dirige se muestra “horrorizada y profundamente conm", "label": "positive", "split": "val"}
{"text": "US kills 14 in strikes on four alleged drug boats in Pacific U.S. forces killed 14 people in strikes on four boats in the Pacific that the Pentagon says were being used to traffic drugs, bringing the total death toll from similar strikes to at least 57. Defense Secretary Pete Hegseth said the strikes were carried out on President Donald Trump's orders, part of a broader campaign now expanding from the Caribbean into the Pacific. The recent actions have drawn regional and international criticism, with Mexico's president objecting and experts and members of Congress questioning the legality and lack of due process. Colombia and Venezuela have also condemned the strikes, warning they are escalating tensions amid U.S. military buildup in the region.", "label": "negative", "split": "val"}
{"text": "'No doubt' Trump wants to topple our government, Venezuelan official tells BBC AFP via Getty Images Tarek William Saab There is \"no doubt\" that US president Donald Trump is trying to overthrow the Venezuelan government, the country's attorney general has told the BBC. Tarek William Saab, a close ally of President Nicolás Maduro, says Trump wants to turn Venezuela into a \"colony\" of the US. Trump has accused Maduro of being the leader of a drug-trafficking organisation, which he denies, and there are fears in Venezuela that a US military build-up is aimed at removing the long-time Trump opponen", "label": "negative", "split": "val"}
{"text": "Europa, que tras la retirada del apoyo de Estados Unidos a Ucrania, se ha quedado sola con la factura del apoyo económico y militar al país invadido por Rusia, busca fórmulas para mantener a flote a Kiev. La idea de la Comisión Europea de entregar a Ucrania un “préstamo de reparación” a interés cero utilizando los activos soberanos rusos inmovilizados por las sanciones fracasó debido al bloqueo de Bélgica, el país que aloja la gran mayoría de ese dinero. Ahora, tras ese paso en falso, el Ejecutivo comunitario busca fórmulas para un muy necesario salvavidas económico. El equipo de la presidenta", "label": "positive", "split": "val"}
{"text": "El presidente del Gobierno, Pedro Sánchez, ha exigido este martes a su homólogo israelí, Beniamin Netanyahu, detener “el genocidio del pueblo palestino” en el segundo aniversario de los atentados de Hamas del 7 de octubre del 2023 que dejaron casi 1.200 muertos y 251 secuestrados israelíes. El jefe del Ejecutivo ha aprovechado la dramática efeméride para reiterar en la red social X “nuestra rotunda condena al terrorismo en todas sus formas”, para pedir la “liberación inmediata” de los rehenes israelíes y para exigir a Netanyahu que “detenga el genocidio del pueblo palestino y abra un corredor", "label": "positive", "split": "val"}
{"text": "Israel ha reanudado este martes los bombardeos sobre Gaza. Poco antes, la oficina del primer ministro de Israel, Benjamín Netanyahu , ordenó al ejército llevar a cabo “ataques contundentes” y de “manera inmediata” sobre la Franja, en respuesta a un ataque “de miembros de Hamás” contra tropas israelíes cerca de Rafah, en el sur del enclave palestino. El comunicado de la oficina de Netanyahu se difundió tras unas “consultas de seguridad” con su Gabinete, que el primer ministro había convocado horas antes, después de que Hamás entregara los restos de un israelí que no correspondían a ninguno de l", "label": "positive", "split": "val"}
{"text": "Han sido 12 horas de alto el fuego en Gaza como si no existiese, con decenas de bombardeos israelíes que han matado a más de cien palestinos, sobre todo niños y mujeres. Es la mayor masacre desde el “fin de la guerra” en la Franja —como lo llamó su muñidor, el presidente de EE UU, Donald Trump— el pasado día 10. Al mediodía de este miércoles, el primer ministro, Benjamín Netanyahu, ha asegurado que el alto el fuego “se vuelve a aplicar”, horas antes de ejecutar un nuevo bombardeo de la Franja en la zona de Beit Lahia, en el norte del territorio. Previamente, había recibido el apoyo de Trump, q", "label": "neutral", "split": "val"}
{"text": "La jefa de Emergencias admite a la jueza que el Cecopi ya debatía el ES-Alert por la dana a las 18.35 horas cuando el Gobierno lo pidiÃ³ A senior emergency official in Valencia, Inmaculada Piles, testified to a judge that technicians began preparing a mobile emergency alert (ES-Alert) at 6:35 pm on the day of massive flooding in and around Valencia, Spain, on October 29, 2024 — 90 minutes before it was actually sent. Because the alert was not issued until 8:11 pm, the judge believes the delay contributed to most of the 229 deaths during the catastrophic floods. Piles said the government delegation requested the alert, and messages show Generalitat officials agreed and began drafting it. She also criticized Spain's weather agency for providing only generic and low-level warnings beforehand. According to sources linked to the accused former regional minister, both the national government and regional authorities participated in preparing the alert, contradicting claims that Madrid was uninvolved.", "label": "negative", "split": "val"}
{"text": "Actualizado Martes, 28 octubre 2025 - 13:59 Durante dos años de guerra en la Franja de Gaza, más de medio millón de niños han sido desplazados , privados de su entorno y de tener una infancia normal. Cerca de 64.000 han muerto o resultado heridos, según datos de la ONU, mientras que cientos de miles forman parte de una generación que ha perdido tres cursos escolares y enfrenta un futuro incierto en el enclave. Con el alto el fuego declarado el 10 de octubre, las organizaciones humanitarias locales e internacionales han empezado a analizar el alcance del trauma de los más pequeños y cómo se pue", "label": "neutral", "split": "val"}
{"text": "El Gobierno aprueba avales y nuevas ayudas por valor de 6.000 millones de euros para los afectados por la dana Spain's Council of Ministers approved a new decree expanding aid for reconstruction after the devastating October 2024 floods in Valencia, adding up to €6 billion in guarantees and assistance. This package extends previous aid that the government says already exceeds €8 billion and includes new ICO financing lines (€750 million), grants for small businesses (€180 million), and a €5 billion guarantee program available through 2040. The decree also prolongs special benefits for self-employed workers, offers Social Security payment deferrals at reduced interest, and expands vehicle-replacement subsidies and housing assistance for flood-affected families. Funds will support relocating residents from flood-risk areas, rebuilding infrastructure with up to 100% cost coverage, and providing aid to cultural and social-service sectors.", "label": "positive", "split": "val"}
{"text": "Actualizado Miércoles, 29 octubre 2025 - 14:23 La agonía del sanchismo es como el tazón de cereales de nuestra infancia: en realidad no quieres que se acabe nunca. Por eso estas últimas sesiones de control (¿cuántas quedarán? ¿trece? ¿diecinueve?) hay que llevárselas despacio a la boca, saboreando el copo de maíz inflado recubierto de chocolate industrial, ralentizando la ingesta con la melancolía anticipada de un subgénero literario que hemos practicado jubilosamente y que va tocando a su fin: el de la narración del cinismo político desorejado. Unos años delirantes donde todo fue científicame", "label": "negative", "split": "val"}
{"text": "US President Donald Trump is set to meet China's president Xi Jinping for the first time since returning to the White House. The two world leaders will hold high stakes talks in South Korea on Thursday, following months of escalating tension between the countries. The BBC's Laura Bicker explains what might be on the agenda - from trade to TikTok - and what the talks could mean for the global economy.", "label": "negative", "split": "val"}
{"text": "La citada cantidad para inversiones supone un incremento del 22,5% sobre la cantidad de 2025 ( 427 ), con 96 millones más. Y, como se ha recalcado desde el Ejecutivo autonómico , es el triple respecto a 2019, primeras cuentas del PP al frente de la comunidad autónoma. Se trata de una cifra récord después de que en la actual 'biblia' económica se marcara una nueva plusmarca. El desembolso que se hará en este apartado vital de las cuentas por cordobés será de 678,8 euros , con lo que el aumento interanual es del 23%. Molina ha destaado que Córdoba se convierte en la provincia andaluza en la que", "label": "positive", "split": "test"}
{"text": "Alassane Ouattara has been declared the winner of the presidential election in Ivory Coast by a landslide. According to provisional results announced by the Independent Electoral Commission (CIE) on Monday evening, the 83-year-old won a fourth term as head of the west African country with 89.77% or 3.75m votes. Ouattara ran against four lesser-known candidates after the opposition heavyweights Laurent Gbagbo and Tidjane Thiam were barred from contesting. But those who appeared on the ballot on Saturday – the former first lady Simone Gbagbo and three former ministers Jean-Louis Billon, Ahoua Do", "label": "positive", "split": "test"}
{"text": "Donald Trump y la nueva primera ministra de Japón, Sanae Takaichi , comparten una visión nacionalista que abraza el proteccionismo económico y la retórica antinmigración por encima de viejos compromisos multilaterales. Ambos apelan a una base conservadora que mezcla orgullo nacional con la nostalgia por tiempos pasados. La japonesa ha importado algunos de los famosos eslóganes del movimiento MAGA de Trump (\"Japón primero\") y apuesta por fortalecer la tradicional alianza de seguridad con Washington . Pero también enfrenta la ardua tarea de lidiar con las demandas comerciales del presidente esta", "label": "positive", "split": "test"}
{"text": "Belize has signed an agreement to act as a \"safe third country\" for migrants as they seek asylum in the United States. The small Central American nation's Prime Minister John Antonio Briceño said the deal - which still needs approval from the Belize Senate - will mean that migrants deported from the US could apply for asylum there instead of returning to their home countries. The US State Department called it \"an important milestone in ending illegal immigration\" and \"shutting down abuse\" of the US asylum system. The agreement appears to be similar to one with Paraguay announced in August. Thi", "label": "positive", "split": "test"}
{"text": "Jamaica comienza a sentir la inminente llegada del “catastrófico” huracán 'Melissa', que deja ya tres muertos Hurricane Melissa, now a Category 5 and one of the strongest Atlantic hurricanes ever recorded, is approaching Jamaica with sustained winds of about 174 mph. The Jamaican government has ordered mass evacuations, warning that no infrastructure in the region can withstand a storm of this magnitude, and at least three deaths have already been reported even before landfall. The storm is expected to bring extreme rainfall, storm surges up to four meters, widespread flooding, and major damage to power, airports, and roads. Airports are closed, shelters are overwhelmed or unprepared, and tens of thousands are already without electricity. After crossing Jamaica, Melissa is expected to move toward Cuba, Turks and Caicos, and the Bahamas.", "label": "neutral", "split": "test"}
{"text": "WASHINGTON (AP) — Vice President JD Vance said Tuesday he believes U.S. military members will be paid at the end of the week, though he did not specify how the Trump administration will reconfigure funding as pain from the second-longest shutdown spreads nationwide. The funding fight in Washington gained new urgency this week as millions of Americans face the prospect of losing food assistance, more federal workers miss their first full paycheck and recurring delays at airports snarl travel plans. “We do think that we can continue paying the troops, at least for now,” Vance told reporters afte", "label": "negative", "split": "test"}
{"text": "Después de una treintena de películas y varias series de televisión a sus espaldas, Nawja Nimri ha dejado claro su valía como intérprete. Y es que su carácter magnético e irreverente no solo la han convertido en una figura imprescindible en la ficción de nuestro país, sino que también le han llevado a acaparar la atención mediática en distintas ocasiones por sus declaraciones sin filtros. Este martes, Nawja Nimri visita 'La Revuelta' a solo tres días del estreno en Netflix de la segunda temporada de 'Respira' . La intérprete volverá a charlar con David Broncano poco más de un año después de su", "label": "negative", "split": "test"}
{"text": "At least 64 people have reportedly been killed in Rio’s worst-ever day of violence as more than 2,500 officers and special forces stormed an area of favelas near Rio’s international airport that is considered the headquarters of one of Brazil’s most powerful organised crime groups. The predawn raid – the deadliest in Rio’s history – sparked intense gunfights in and around Alemão and Penha favelas, which are home to an estimated 300,000 people. Drug traffickers from the Red Command criminal faction started shooting and set barricades and cars alight as civil and military police and special forc", "label": "negative", "split": "test"}
{"text": "28/10/2025 Actualizado a las 17:49h. Un vuelo que realizaba el recorrido entre Chicago y Alemania ha tenido que ser desviado al aeropuerto de Boston después de que un hombre de 28 años atacase a varios pasajeros. En concreto, apuñaló con un tenedor a dos adolescentes , pegó una bofetada a ... una pasajera y a un miembro de la tripulación e hizo como que se disparaba a sí mismo , informa AP, que cita a las autoridades. Una vez en tierra, el joven fue detenido . Se le imputa un delito de agresión con arma peligrosa. Los apuñalados, según ha informado la Fiscalía, son dos chicos de 17 años . Uno", "label": "positive", "split": "test"}
{"text": "Melissa, un huracán 'de manual' en tiempos de crisis climática The World Meteorological Organization calls Hurricane Melissa “the storm of the century for Jamaica,” as the Category 5 cyclone rapidly intensified from Category 1 to Category 5 in about 48 hours, with winds nearly tripling to near 186 mph and forward speed around 6.8 mph. Experts Rodney Martínez of the WMO and Cuban meteorologist José Rubiera say the storm's explosive growth and slow movement are textbook outcomes of climate change and warmed seas, warning of catastrophic rainfall, storm surge, and landslides on Jamaica's mountainous terrain. Jamaica and Cuba activated early-warning and evacuation measures. Airports closed in Jamaica, and Cuba is prepositioning aid while its utility authority plans controlled shutdowns of power plants. The Red Cross estimates at least 1.5 million Jamaicans will be directly affected, and UNICEF says up to 1.6 million children are at risk across the Caribbean. Three deaths in Jamaica were reported by midday Tuesday. The UN will release $4 million from its emergency fund to support preventative measures for 170,000 people in eastern Cuba.", "label": "negative", "split": "test"}
{"text": "At least 60 people were killed on Tuesday in a police operation targeting a major gang in Rio de Janeiro, days before the city hosts global events related to the UN climate summit known as Cop30. The predawn raid – the deadliest in Rio’s history – sparked intense gunfights in and around Alemão and Penha favelas. Police often conduct large-scale operations against organised crime ahead of big events in Rio", "label": "negative", "split": "test"}
{"text": "TikTok creator and US marshal shot during LA immigration raid Department of Justice A TikTok creator and a US marshal have both been injured by gunfire during an immigration enforcement operation in Los Angeles, officials have said. The Department of Homeland Security (DHS) said Carlitos Ricardo Parias, who they said was in the US illegally, allegedly rammed law enforcement vehicles with his car while trying to flee an immigration arrest on Tuesday. Officers fired and struck Mr Parias' elbow, and a US marshal was hit in the hand by a ricocheting bullet, it said. Both were hospitalised with non", "label": "neutral", "split": "test"}
{"text": "Half of US states have sued the Trump administration over its plans to halt funding for food aid used by more than 40 million low-income Americans. The states hope to force the administration to use a roughly $6bn (£4.5bn) emergency contingency fund for the Supplemental Nutrition Assistance Program (Snap), also known as food stamps. The US Department of Agriculture (Usda), which oversees Snap, has said it would not use it and allow funds to run dry in November, arguing the money may be needed for emergencies, such as natural disasters. Republicans and Democrats have traded blame for the ongoin", "label": "negative", "split": "test"}
{"text": "Bill Gates calls for climate fight to shift focus from global heating to 'improving lives' Bill Gates has published a memo calling for a “strategic pivot“ on climate efforts, arguing that instead of focusing primarily on limiting global temperature rise, the world should prioritize reducing poverty and disease, which he says pose a greater threat to most people. Gates wrote that climate change will bring serious impacts, especially for poorer nations, but rejected what he called a “doomsday view,“ saying humanity will still be able to live and thrive. His comments contrast sharply with UN Secretary General António Guterres, who warned the world has already failed to avoid surpassing the 1.5°C limit and faces “devastating consequences“ and potential tipping points in places like the Amazon and Antarctica.", "label": "neutral", "split": "test"}
{"text": "Hamas, Palestina y la derrota de Israel tras dos años de exterminio en Gaza In the two years since Hamas attacked southern Israel on October 7, 2023, killing 1,200 people and taking 251 hostages, Israel's military campaign has devastated Gaza, with a UN report describing the resulting conflict as genocide and citing more than 67,000 Palestinians killed and entire cities destroyed. The offensive has empowered ultranationalist ministers in Israel's government and split Israeli society over the war's direction and the fate of the hostages. While the United States has backed Israel militarily, 152 countries recognize Palestine and see the conflict through the lens of colonialism and failed international intervention. President Donald Trump has proposed a deal involving hostage-prisoner exchanges, a ceasefire, and international reconstruction of Gaza, though it does not resolve the issue of Palestinian statehood.", "label": "negative", "split": "test"}
{"text": "Atlanta journalist says he 'won't be the only one deported by Trump officials Mario Guevara, an Emmy-winning journalist and longtime U.S. resident, was deported from the U.S. by the Trump administration on October 3 and believes he may be the first immigrant journalist removed while reporting. Guevara, who fled El Salvador in 2004 and had a work permit, was arrested while livestreaming an anti-Trump protest in Atlanta. Prosecutors dropped charges, but immigration authorities reopened a decade-old asylum case and deported him. He argues the move was retaliation for his reporting, while the administration claims he was deported solely because he lacked legal status. Guevara warns that journalists — especially immigrants — could face more aggressive targeting, saying, “They see the media as an enemy.“", "label": "negative", "split": "test"}
{"text": "Cartas al director El arquitecto que diseñó el teatro IMAX Madrid nos escribe para comentar el derrumbe de su icónica cúpula que forma parte del paisaje de la capital durante décadas", "label": "neutral", "split": "test"}
{"text": "Hurricane Melissa has made landfall in Jamaica as a catastrophic category 5 storm, the strongest to lash the island since record-keeping began in 1851. The slow-moving giant hit the island on Tuesday afternoon and is expected to linger, moving diagonally through it until heading on to slam into Cuba, with impacts also expected in Haiti and the Bahamas. How intense is the storm? Melissa is particularly dangerous as it intensified extremely quickly and is moving at the sluggish speed of a person running, meaning it will hover over Jamaica for longer, compounding the damage. The storm’s winds esc", "label": "negative", "split": "test"}
{"text": "F ranck Detcheverry, Miquelon’s 41-year-old mayor, trudges up a grassy hill. “The view isn’t too bad, huh?” he jokes. The ocean sparkles 40 metres below the empty mound. The sound of a man playing the bagpipes, as if serenading the sea, floats up from the shoreline. This hill will be the location of his new home and those of all his fellow villagers. In the distance, about half a mile away, you can see the outline of the 400 or so buildings in the village of Miquelon. It sits only 2 metres above sea level on the archipelago of Saint-Pierre and Miquelon. Situated off the Canadian coast to the s", "label": "neutral", "split": "test"}
{"text": "Luiz Inácio Lula da Silva has announced he will run for a fourth term as Brazil's president in the nation's elections in 2026. The 79-year-old had indicated during his last election campaign that it would be his last - but stressed he did not feel his age in comments during a state visit to Indonesia on Thursday. \"I'm about to turn 80 years old, but you can be sure I have the same energy I had when I was 30. And I will run for a fourth term in Brazil,\" Lula told reporters. The decision to run comes despite Lula suffering health problems in office after winning in the tightest run-off election", "label": "positive", "split": "test"}
